/////// IDD_RCS_SLAB_PMODE_DLG
IDC_GURSL_FRAME_MATERIAL                      = "材料"
IDC_GSLAB_CHECK_MATERIAL_LCON                 = "輕質混凝土"
IDC_GURSL_BTN_DGNLOAD                         = "..."
IDC_GURSL_CHECK_DLOAD_UUI                     = "自定義設計載重"
IDC_GURSL_RADIO_STYPE_1WAY                    = "單向版"
IDC_GURSL_RADIO_STYPE_2WAY                    = "雙向版"
IDC_GURSL_CHECK_BB_B2                         = "同B1"
IDC_GURSL_CHECK_BB_B4                         = "同B3"
IDC_GURSL_DADIO_1WY_1                         = "單向支承"
IDC_GURSL_RADIO_BAR_TYA                       = "類型-A (斷筋+折筋)"
IDC_GURSL_RADIO_BAR_TYB                       = "類型-B (直通+折筋)"
IDC_GURSL_RADIO_BAR_TYC                       = "類型-C (直通筋)"
IDC_GURSL_FRAME_SC_2WAY                       = "支承條件 (雙向)"
IDC_GURSL_LABEL_MATERIAL_FCK                  = "混凝土"
IDC_GURSL_LABEL_MATERIAL_RB                   = "鋼筋"
IDC_GURSL_FRAME_DESIGN_LOAD                   = "設計載重"
IDC_GURSL_LABEL_DLOAD_DL                      = "靜載重"
IDC_GURSL_LABEL_DLOAD_LL                      = "活載重"
IDC_GURSL_FRAME_DIMEMSION                     = "尺寸"
IDC_GURSL_LABEL_DIMENSION_SPX                 = "跨度 (Lx)"
IDC_GURSL_LABEL_DIMENSION_SPY                 = "跨度 (Ly)"
IDC_GURSL_LABEL_DIMENSION_THIC                = "版厚"
IDC_GURSL_LABEL_DIMENSION_COVER               = "保護層厚度"
IDC_GURSL_FRAME_SLAB_TYPE                     = "樓版類型"
IDC_GURSL_FRAME_ARRANGE                       = "鋼筋配置方式"
IDC_GURSL_FRAME_ARRANGE_X                     = "鋼筋資料 (Y方向)"
IDC_GURSL_FRAME_ARRANGE_Y                     = "鋼筋資料 (X方向)"
IDC_GURSL_FRAME_SC_1WAY                       = "支承條件 (單向)"
IDC_GURSL_FRAME_BB                            = "邊梁"
IDC_GURSL_LABEL_BB_B1                         = "B1"
IDC_GURSL_LABEL_BB_B2                         = "B2"
IDC_GURSL_LABEL_BB_B3                         = "B3"
IDC_GURSL_LABEL_BB_B4                         = "B4"
IDC_GURSL_FRAME_ARRANGE_ETC                   = "檢核計算結果"
IDC_GURSL_CHECK_USE_CLEARSPAN                 = "使用淨跨度設計"
IDC_GURSL_FRAME_DEFLECTION                    = "撓度檢核參數"
IDC_GURSL_LABEL_DEFLECTION_SHORT__L_P              = "即時撓度"
IDC_GURSL_LABEL_DEFLECTION_LONG               = "長時撓度"
IDC_GURSL_LABEL_DEFLECTION_DURATION1          = "時間效應因數"
IDC_GSLAB_RADIO_CRACK_DRY                     = "Dry"
IDC_GSLAB_RADIO_CRACK_ETC                     = "Etc"
IDC_GURSL_LABEL_DEFLECTION_DURATION2          = "(月)"
IDC_GURSL_LABEL_DEFLECTION_DURATION2_IS       = "(Days)"
IDC_GSLAB_LABEL_MATERIAL_FACT                 = "因數"
IDC_GSLAB_FRAME_CRACK                         = "裂縫控制"
IDS_GURSL_FAIL_REBAR_DATA_NOT_CHANGED         = "Rebar Data is not Changed"
IDS_GSLAB_RADIO_CRACK_MILD                    = "Mild or Moderate"
IDS_GSLAB_RADIO_CRACK_SEVERE                  = "Severe"

//IDD_RCS_SLAB_DESIGN_DLG
IDD_RCS_SLAB_DESIGN_DLG                       = "設計結果 (樓版)"
IDC_GSLAB_DESIGN_RESULT_TXT                   = "選擇鋼筋號數"

//IDD_RCS_URSL_SECT_DLG
IDC_GURSL_CHECK_MATERIAL_LCON                 = "輕質混凝土"
IDC_GURSL_FRAME_THICK                         = "厚度"
IDC_GURSL_THICK_BTN_ADD                       = "新增"
IDC_GURSL_THICK_BTN_DEL                       = "刪除"
IDC_GURSL_THICK_BTN_INS                       = "插入"
IDC_GURSL_CHK_SAME_COVER                      = "使用相同保護層厚度"
IDC_GURSL_FRAME_REBAR                         = "鋼筋"
IDC_GURSL_FRAME_SPACE                         = "鋼筋間距"
IDC_GURSL_SPACE_BTN_ADD                       = "新增"
IDC_GURSL_SPACE_BTN_DEL                       = "刪除"
IDC_GURSL_SPACE_BTN_INS                       = "插入"
IDC_GURSL_RADIO_CRACK_DRY                     = "Dry"
IDC_GURSL_RADIO_CRACK_ETC                     = "Etc"
IDC_GURSL_LABEL_MATERIAL_FY                   = "主筋"
IDC_GURSL_LABEL_MAINBAR                       = "主筋"
IDC_GURSL_LABEL_REBAR                         = "鋼筋支數"
IDC_GURSL_LABEL_MATERIAL_FACT                 = "因數"
IDC_GURSL_FRAME_CRACK                         = "裂縫控制"

//IDD_RCS_URSL_PMODE_DLG
IDC_GURSL_FRAME_RESULT                        = "檢核計算結果"

/////// IDD_RCS_SLAB_RBAR_DLG
IDC_GURSL_LABEL_REBAR_INIBAR                  = "最小鋼筋號數"
IDC_GURSL_LABEL_REBAR_ININO                   = "鋼筋支數"

/////// IDD_RCS_BEAM_PMODE_DLG
IDC_GURBE_FRAME_MATERIAL                      = "材料"
IDC_GURBE_LABEL_MATERIAL_FCK                  = "混凝土"
IDC_GURBE_LABEL_MATERIAL_FY                   = "主筋"
IDC_GURBE_LABEL_MATERIAL_FYS                  = "箍筋"
IDC_GURBE_CHECK_MATERIAL_LCON                 = "輕質混凝土"
IDC_GURBE_LABEL_MATERIAL_FACT                 = "因數"
IDC_GURBE_FRAME_SECTION                       = "斷面"
IDC_GURBE_LABEL_SECTION_B                     = "寬度"
IDC_GURBE_LABEL_SECTION_H                     = "深度"
IDC_GURBE_LABEL_SECTION_CC_TOP                = "保護層厚度 (頂部)"
IDC_GURBE_LABEL_SECTION_CC_BOT                = "保護層厚度 (底部)"
IDC_GURBE_CHECK_USE_TOPCOVER                  = "使用相同保護層厚度"
IDC_GURBE_FRAME_TYPE                          = "類型"
IDC_GURBE_RADIO_SINGLE                        = "單筋"
IDC_GURBE_RADIO_DOUBLE                        = "雙筋"
IDC_GURBE_FRAME_SHAPE                         = "形狀"
IDC_GURBE_RADIO_RECT                          = "矩形梁"
IDC_GURBE_RADIO_TSHAPE                        = "T形梁"
IDC_GURBE_LABEL_SECTION_SLABTHK               = "樓版厚度"
IDC_GURBE_LABEL_SECTION_EFFWIDTH              = "有效寬度"
IDC_GURBE_FRAME_SKINBAR                       = "腰筋"
IDC_GURBE_LABEL_SKINBAR_NO                    = "腰筋"
IDC_GURBE_CHECK_DISTRIBUTE                    = "兩側均勻分佈"
IDC_GURBE_CHECK_DEFLECTION                    = "檢核撓度"
IDC_GURBE_STC_DEFL_SET                        = "撓度檢核參數"
IDC_GURBE_FRAME_SEISMIC_DESIGN                = "耐震設計"
IDC_GURBE_CHECK_SEISMIC_PROVISIONS            = "套用耐震設計特別規定"
IDC_GURBE_RADIO_SPECIAL_MOMENT                = "SMF"
IDC_GURBE_RADIO_INTERMEDIATE_MOMENT           = "IMF"
IDC_GURBE_RADIO_ORDINARY_MOMENT               = "OMF"
IDC_GURBE_CHECK_SEISMIC_PILOTI_GUIDE          = "Apply Pilotis Guideline, MOLIT"
IDC_GURBE_FRAME_ARRANGE                       = "鋼筋配置方式"
IDC_GURBE_RADIO_ARRANGETYPE1                  = "類型-1 (全斷面)"
IDC_GURBE_RADIO_ARRANGETYPE2                  = "類型-2 (端部 && 中央)"
IDC_GURBE_RADIO_ARRANGETYPE3                  = "類型-3 (兩端 && 中央)"
IDC_GURBE_STRING_COMMAND                      = "更換斷面參數 :"
IDC_GURBE_CHECK_FORCE_ONLY                    = "僅更換力量"
IDC_GURBE_CHECK_DIFFER_REBAR                  = "個別指定鋼筋號數"
IDC_GURBE_CHECK_TOPBOT_SAMEREBAR              = "鋼筋號數一致"
IDC_GURBE_FRAME_SPLICE                        = "主筋間距規則"
IDC_GURBE_RADIO_SPLICE000                     = "不考慮搭接"
IDC_GURBE_RADIO_SPLICE050                     = "50% 搭接"
IDC_GURBE_RADIO_SPLICE100                     = "100% 搭接"
IDC_GURBE_FRAME_CRACK                         = "裂縫控制"
IDC_GURBE_RADIO_CRACK_DRY                     = "Dry"
IDC_GURBE_RADIO_CRACK_ETC                     = "Etc"

/////// IDD_RCS_BEAM_MLIST_DLG
IDC_RCS_BTN_MAKE_DATA                         = "Make Data"
IDC_GURBE_LIST_CHK_REBAR                      = "顯示詳細鋼筋資料"
IDS_RCS_MAKE_DATA_FIRST                       = "To edit data by Member List, Make data first"

/////// IDD_RCS_BEAM_SECT_DLG
IDC_GURBE_FRAME_FORCE                         = "外力"
IDC_GURBE_LABEL_FORCE_M                       = "彎矩"
IDC_GURBE_LABEL_FORCE_S                       = "剪力"

/////// IDD_RCS_DEFL_DLG
IDD_RCS_DEFL_DLG                              = "撓度檢核參數"
IDC_RCS_DEFL_FRM_MEMB                         = "選擇構件"
IDC_RCS_DEFL_BTN_ALL                          = "全選"
IDC_RCS_DEFL_BTN_NONE                         = "全不選"
IDC_RCS_DEFL_RDO_LINE_LOAD                    = "線載重"
IDC_RCS_DEFL_RDO_MOMENT                       = "彎矩"
IDC_RCS_DEFL_BTN_OK                           = "套用"
IDC_RCS_DEFL_BTN_CANCEL                       = "取消"
IDC_RCS_DEFL_FRM_DESIGN_LOAD                  = "設計載重"
IDC_RCS_DEFL_LBL_SUSTAINED_LOAD               = "持續載重"
IDC_RCS_DEFL_LBL_SPAN                         = "跨度"
IDC_RCS_DEFL_FRM_SUPPORT_CONDITION            = "支承條件"
IDC_RCS_DEFL_FRM_CONDITION_FACTORS            = "因數"
IDC_RCS_DEFL_LBL_SHORT_TERM                   = "即時撓度"
IDC_RCS_DEFL_STC_SHORT_TERM                   = "L /"
IDC_RCS_DEFL_LBL_LONG_TERM                    = "長時撓度"
IDC_RCS_DEFL_STC_LONG_TERM                    = "L /"
IDC_RCS_DEFL_LBL_TIME_FACTOR                  = "時間效應因數"
IDC_RCS_DEFL_STC_TIME_FACTOR                  = "(月)"
IDC_RCS_DEFL_FRM_CONDITION_SPAN               = "跨度"

/////// IDD_RCS_DEFL_LOAD_LINE_DLG
IDC_RCS_DEFL_LBL_DEAD_LOAD                    = "靜載重"
IDC_RCS_DEFL_LBL_LIVE_LOAD                    = "活載重"
IDC_RCS_DEFL_FRM_DGN_LOAD                     = "設計載重"

/////// IDD_RCS_DEFL_LOAD_MOME_DLG
IDC_RCS_DEFL_LBL_MDI                          = "M ( i )"
IDC_RCS_DEFL_LBL_MLI                          = "M ( i )"
IDC_RCS_DEFL_LBL_MDM                          = "M ( m )"
IDC_RCS_DEFL_LBL_MLM                          = "M ( m )"
IDC_RCS_DEFL_LBL_MDJ                          = "M ( j )"
IDC_RCS_DEFL_LBL_MLJ                          = "M ( j )"
IDC_RCS_DEFL_FRM_DEAD                         = "靜載重"
IDC_RCS_DEFL_FRM_LIVE                         = "活載重"

////// IDD_RCS_COMBINED_FOOTING_DEF_COLM_DLG
IDD_RCS_COMBINED_FOOTING_DEF_COLM_DLG         = "定義柱參數"
IDC_GUCBF_COLM_DATA_GRP                       = "柱參數"
IDC_GUCBF_COLM_DATA_ADD_BTN                   = "新增"
IDC_GUCBF_COLM_DATA_DEL_BTN                   = "刪除"
IDC_GUCBF_COLM_DATA_INS_BTN                   = "插入"

////// IDD_RCS_COMBINED_FOOTING_INPUT_DLG
IDC_GUCBF_MATL_GRP                            = "材料"
IDC_GUCBF_MATL_FCK_STC                        = "混凝土"
IDC_GUCBF_MATL_MB_STC                         = "主筋"
IDC_GUCBF_MATL_LCON_CHK                       = "輕質混凝土"
IDC_GUCBF_MATL_FACT_STC                       = "因數"
IDC_GUCBF_DESIGN_LOAD_GRP                     = "設計載重"
IDC_GUCBF_DLOAD_SW_CHK                        = "計算基礎自重"
IDC_GUCBF_SURCHARGE_LOAD_STC                  = "地面超載"
IDC_GUCBF_FOOTING_GRP                         = "基礎版"
IDC_GUCBF_FOOTING_SPREAD_RDO                  = "擴展基礎"
IDC_GUCBF_FOOTING_PILE_RDO                    = "樁基礎"
IDC_GUCBF_FOOTING_DEPTH_STC                   = "厚度"
IDC_GUCBF_FOOTING_COVER_STC                   = "保護層厚度"
IDC_GUCBF_COLM_GRP                            = "柱"
IDC_GUCBF_SEL_COLM_GRP                        = "選擇柱"
IDC_GUCBF_SEL_COLM_ALL_BTN                    = "全選"
IDC_GUCBF_SEL_COLM_NONE_BTN                   = "全不選"
IDC_GUCBF_SEL_COLM_INVERT_BTN                 = "反選"
IDC_GUCBF_SEL_COLM_DATA_BTN                   = "柱參數"
IDC_GUCBF_SECT_GRP                            = "斷面"
IDC_GUCBF_SECT_RECT_RDO                       = "矩形"
IDC_GUCBF_SECT_CIRC_RDO                       = "圓形"
IDC_GUCBF_FORCE_GRP                           = "外力"
IDC_GUCBF_LCOM_BTN                            = "載重組合..."
IDC_GUCBF_IMPORT_DXF_BTN                      = "匯入AutoCAD檔..."
IDC_GUCBF_REBAR_GRP                           = "鋼筋配置方式"
IDC_GUCBF_POSITION_FOOTING_RDO                = "基礎版"
IDC_GUCBF_POSITION_COLUMN_RDO                 = "柱"
IDC_GUCBF_POSITION_PILE_RDO                   = "樁基礎"
IDC_GUCBF_POSITION_GRP                        = "位置資料"
IDC_GUCBF_PROPERTY_GRP                        = "性質"
IDC_GUCBF_RESULT_GRP                          = "檢核計算結果"
IDC_GUCBF_INPUT_BTN_DESIGN                    = "設計"
IDC_GUCBF_INPUT_BTN_CHECK                     = "檢核"
IDC_GUCBF_INPUT_BTN_REPORT                    = "報表 ..."
IDC_GUCBF_INPUT_BTN_APPLY                     = "套用"

////// IDD_RCS_COMBINED_FOOTING_LIST_DLG
IDC_GUCBF_LIST_TYPE_STC                       = "類型"
IDC_GUCBF_LIST_SPREAD_RDO                     = "擴展基礎"
IDC_GUCBF_LIST_PILE_RDO                       = "樁基礎"

////// IDD_RCS_COMBINED_FOOTING_SMODE_REBAR_DLG
IDC_GUCBF_RBAR_GRP                            = "鋼筋"
IDC_GUCBF_RBAR_INIT_X_STC                     = "最小鋼筋號數 (X)"
IDC_GUCBF_RBAR_INIT_Y_STC                     = "最小鋼筋號數 (Y)"
IDC_GUCBF_POSITION_BTN                        = "位置資料..."

////// IDD_RCS_COMBINED_FOOTING_SMODE_SECT_DLG
IDC_GUCBF_SECT_CX_STC                         = "直徑"

////// IDD_RCS_COMBINED_FOOTING_SURCHARGE_DLG
IDC_GUCBF_SURCHARGE_LOAD_GRP                  = "地面超載"
IDC_GUCBF_SLOAD_WD_STC                        = "土單位重"
IDC_GUCBF_SLOAD_H_STC                         = "覆土深度"

////// IDD_RCS_STRIPFOOT_INPUT_DLG
IDC_GURSF_FRM_MATERIAL                        = "材料"
IDC_GURSF_LABEL_MATERIAL_FCK                  = "混凝土"
IDC_GURSF_LABEL_MATERIAL_FY                   = "主筋"
IDC_GURSF_LABEL_MATERIAL_FYS                  = "肋筋"
IDC_GURSF_LABEL_MATERIAL_FYS3                 = "橫向鋼筋"
IDC_GURSF_FRM_SECTION                         = "斷面"
IDC_GURSF_LBL_SECTION_SHAPE                   = "形狀"
IDC_GURSF_LBL_SECTION_H                       = "高度"
IDC_GURSF_LBL_SECTION_B                       = "寬度"
IDC_GURSF_LBL_SECTION_B2                      = "寬度2"
IDC_GURSF_LBL_SECTION_WEB                     = "腹板寬"
IDC_GURSF_LBL_SECTION_FLG                     = "翼板厚"
IDC_GURSF_LBL_SECTION_CC_TOP                  = "保護層厚度 (上層)"
IDC_GURSF_LBL_SECTION_CC_BOT                  = "保護層厚度 (下層)"
IDC_GURSF_CHK_USE_BOTCOVER                    = "使用相同保護層厚度"
IDC_GURSF_FRM_TYPE                            = "類型"
IDC_GURSF_RADIO_SINGLE                        = "單筋"
IDC_GURSF_RADIO_DOUBLE                        = "雙筋"
IDC_GURSF_FRM_SOIL                            = "土壤承載力"
IDC_GURSF_LBL_SOIL_BEAR                       = "土壤承載力"
IDC_GURSF_FRM_SPLICE                          = "主筋間距規則"
IDC_GURSF_RDO_SPLICE000                       = "不考慮搭接"
IDC_GURSF_RDO_SPLICE050                       = "50% 搭接"
IDC_GURSF_RDO_SPLICE100                       = "100% 搭接"
IDC_GURSF_FRM_ARRANGE                         = "鋼筋配置方式"
IDC_GURSF_RADIO_ARRANGETYPE1                  = "類型-1 (全斷面)"
IDC_GURSF_RADIO_ARRANGETYPE2                  = "類型-2 (端部 && 中央)"
IDC_GURSF_RADIO_ARRANGETYPE3                  = "類型-3 (兩端 && 中央)"
IDC_GURSF_STRING_COMMAND                      = "更換斷面參數 :"
IDC_GURSF_BTN_COMMAND_MAX                     = "max( i,m,j )"
IDC_GURSF_BTN_COMMAND_MAX_IJ                  = "max( i,j )"
IDC_GURSF_BTN_COMMAND_SWITCH                  = "i <-> j"
IDC_GURSF_CHECK_FORCE_ONLY                    = "僅更換力量"
IDC_GURSF_CHECK_DIFFER_REBAR                  = "個別指定鋼筋號數"
IDC_GURSF_CHECK_TOPBOT_SAMEREBAR              = "鋼筋號數一致"
IDC_GURSF_CHECK_SHOW_LCB                      = "顯示載重組合"

////// IDD_RCS_STRIPFOOT_LIST_DLG
IDC_GURSF_LIST_CHK_REBAR                      = "顯示詳細鋼筋資料"

////// IDD_RCS_STRIPFOOT_SMODE_INPUT_SECT_DLG
IDC_GURSF_FRAME_FORCE                         = "外力"
IDC_GURSF_LABEL_FORCE_M                       = "彎矩"
IDC_GURSF_LABEL_FORCE_S                       = "剪力"
IDC_GURSF_FRAME_SOIL                          = "土壤反力/承載力"
IDC_GURSF_LABEL_SOIL_FORC                     = "反力"
IDC_GURSF_LABEL_SOIL_BEAR                     = "土壤承載力"

////// IDD_URCF_COLM_DLG
IDD_URCF_COLM_DLG                             = "柱詳細資料"
IDC_GURCF_COLM_SECT_GRP                       = "柱斷面"
IDC_GURCF_COLM_SECT_SHAPE_RECT                = "矩形"
IDC_GURCF_COLM_SECT_SHAPE_CIR                 = "圓形"
IDC_GURCF_COLM_SECT_Cx_TEXT                   = "Cx"
IDC_GURCF_COLM_SECT_Cy_TEXT                   = "Cy"
IDC_GURCF_COLM_LOAD_SERV                      = "使用載重"
IDC_GURCF_COLM_LOAD_Ps_TEXT                   = "Ps"
IDC_GURCF_COLM_LOAD_SERV_LCOM_BTN             = "載重組合 ..."
IDC_GURCF_COLM_LOAD_FACT                      = "因數載重"
IDC_GURCF_COLM_LOAD_FACT_LCOM_BTN             = "載重組合 ..."
IDC_BTN_CHECK_LCOM_NUMB                       = "Check Load Combinations"
IDC_LCOM_NUMB_DOES_MATCH                      = "The number of load combinations does match."
IDC_LCOM_NUMB_DOES_NOT_MATCH                  = "The number of load combinations does not match."

////// IDD_URCF_PMODE_DLG
IDC_GURCF_MATL_GRP                            = "材料"
IDC_GURCF_MATL_FCK_STC                        = "混凝土"
IDC_GURCF_MATL_MB_STC                         = "主筋"
IDC_GURCF_MATL_LCON_CHK                       = "輕質混凝土"
IDC_GURCF_MATL_FACT_STC                       = "因數"
IDC_GURCF_COLM_GRP                            = "柱參數"
IDC_GURCF_COLM_ADD_BTN                        = "新增"
IDC_GURCF_COLM_DEL_BTN                        = "刪除"
IDC_GURCF_FOOTING_GRP                         = "基礎版"
IDC_GURCF_FOOTING_DEPTH_STC                   = "厚度"
IDC_GURCF_FOOTING_COVER_STC                   = "保護層厚度"
IDC_GURCF_PROPERTY_GRP                        = "基礎版尺寸"
IDC_GURCF_DESIGN_LOAD_GRP                     = "設計載重"
IDC_GURCF_LABEL_SLOAD_SL                      = "地面超載"
IDC_GURCF_LABEL_SLOAD_WD                      = "土單位重"
IDC_GURCF_LABEL_SLOAD_H                       = "覆土深度"
IDC_GURCF_DLOAD_SW_CHK                        = "計算基礎自重"
IDC_GURCF_FRAME_PREVIEW                       = "預覽 (剖面 && 示意圖)"
IDC_GURCF_LABEL_PREVIEW_ITEM                  = "顯示內容"
IDC_GURCF_LABEL_TXTSIZE                       = "文字大小"
IDC_GURCF_REBAR_INFO_CHK                      = "鋼筋資料"
IDC_GURCF_DIMENSION_CHK                       = "尺寸"
IDC_GURCF_COLM_NAME_CHK                       = "柱名稱"
IDC_GURCF_VALUE_CHK                           = "數值"
IDC_GURCF_REBAR_X_DIR_GRP                     = "鋼筋配置方式 ( X向 )"
IDC_GURCF_REBAR_X_DIR_SEL_STC                 = "鋼筋位置 :"
IDC_GURCF_REBAR_Y_DIR_GRP                     = "鋼筋配置方式 ( Y向 )"
IDC_GURCF_REBAR_Y_DIR_SEL_STC                 = "鋼筋位置 :"
IDC_GURCF_RESULT_GRP                          = "檢核計算結果"
IDC_GURCF_INPUT_BTN_DESIGN                    = "設計"
IDC_GURCF_INPUT_BTN_CHECK                     = "檢核"
IDC_GURCF_INPUT_BTN_REPORT                    = "報表 ..."
IDC_GURCF_INPUT_BTN_APPLY                     = "套用"
IDC_GURCF_SURCHARGE_CHK                       = "包含外加荷載"

////// IDD_URCF_MLIST_COLM_DLG
IDD_URCF_MLIST_COLM_DLG                       = "柱資料"
IDC_GURCF_LIST_COLM_TEXT                      = "詳細資料"
IDC_GURCF_LIST_COLM_ADD                       = "新增"
IDC_GURCF_LIST_COLM_DEL                       = "刪除"

////// IDD_URCF_RBAR_INFO_DLG
IDD_URCF_RBAR_INFO_DLG                        = "鋼筋資料"

////// IDD_URCF_RBAR_DLG
IDC_GURCF_FRAME_FOUNDATION                    = "基礎版"
IDC_GURCF_LABEL_FD_THICKNESS                  = "厚度"
IDC_GURCF_LABEL_FD_COVER                      = "保護層厚度"
IDC_GURCF_FRAME_PROPERTY                      = "性質"
IDC_GURCF_FRAME_RBAR                          = "鋼筋"
IDC_GURCF_LABEL_RBAR_INIT_X                   = "最小鋼筋號數 (x)"
IDC_GURCF_LABEL_RBAR_INIT_Y                   = "最小鋼筋號數 (y)"
IDC_GURCF_LABEL_BAR_NO                        = "鋼筋支數"

////// IDD_URCF_SECT_DLG
IDC_GURCF_FRAME_SURCHARGE_LOAD                = "載重資料"

////// IDD_RCS_BATCHWALL_BUILD_DLG
IDD_RCS_BATCHWALL_BUILD_DLG                   = "建物資料設定"
IDC_GURGW_BUILD_TEXT                          = "建物資料"
IDC_GURGW_BUILD_STORY_TEXT                    = "樓層群組"
IDC_GURGW_BUILD_CMB_FR_TEXT                   = "從"
IDC_GURGW_BUILD_CMB_TO_TEXT                   = "至"
IDC_GURGW_BUILD_CMB_INC_TEXT                  = "增量"
IDC_GURGW_BUILD_BTN_SEL                       = "選取"
IDC_GURGW_BUILD_BTN_NON                       = "取消選取"
IDC_GURGW_BUILD_BTN_APP                       = "確認"
IDC_GURGW_BUILD_BTN_CAN                       = "取消"

////// IDD_RCS_BATCH_COLM_BUILD_DLG
IDD_RCS_BATCH_COLM_BUILD_DLG                  = "建物資料設定"
IDC_GURBC_FRM_BUILD_DATA                      = "建物資料"
IDC_GURBC_LBL_STORY_GROUP                     = "樓層群組"
IDC_GURBC_LBL_STORY_FR                        = "從"
IDC_GURBC_LBL_STORY_TO                        = "至"
IDC_GURBC_LBL_STORY_IN                        = "增量"
IDC_GURBC_BTN_SLCT                            = "選取"
IDC_GURBC_BTN_NONE                            = "取消選取"
IDC_GURBC_BTN_OKOK                            = "確認"
IDC_GURBC_BTN_CNCL                            = "取消"

////// IDD_RCS_BATCH_BEAM_BUILD_DLG
IDD_RCS_BATCH_BEAM_BUILD_DLG                  = "建物資料設定"
IDC_RCS_FRM_BUILD_DATA                        = "建物資料"
IDC_RCS_LBL_STORY_GROUP                       = "樓層群組"
IDC_RCS_LBL_STORY_FR                          = "從"
IDC_RCS_LBL_STORY_TO                          = "至"
IDC_RCS_LBL_STORY_IN                          = "增量"
IDC_RCS_BTN_SLCT                              = "選取"
IDC_RCS_BTN_NONE                              = "取消選取"
IDC_RCS_BTN_OKOK                              = "確認"
IDC_RCS_BTN_CNCL                              = "取消"

////// IDD_RCS_BATCH_WALL_BUILD_DLG
IDD_RCS_BATCH_WALL_BUILD_DLG                  = "建物資料設定"
IDC_GURGW_FRM_BUILD_DATA                      = "建物資料"
IDC_GURGW_LBL_STORY_GROUP                     = "樓層群組"

////// IDD_RCS_BATCHWALL_INPUT_DLG
IDC_GURGW_FRAME_MAP                           = "位置示意圖"
IDC_GURGW_FRAME_WALLID                        = "牆ID"
IDC_GURGW_INPUT_BTN_SMART_DESIGN_MEM          = "構件智能設計"
IDC_GURGW_BTN_SMARTDGN                        = IDC_GURGW_INPUT_BTN_SMART_DESIGN_MEM
IDC_GURGW_FRAME_WALL                          = "牆資料"
IDC_GURGW_LABEL_STORY_FR                      = "從"
IDC_GURGW_LABEL_STORY_TO                      = "至"
IDC_GURGW_LABEL_STORY_BY                      = "by"
IDC_GURGW_BTN_STORY_SEL                       = "選擇"
IDC_GURGW_BTN_STORY_NON                       = "全不選"
IDC_GURGW_LABEL_NOTE                          = "Ctrl+Up/Dn 可複製"
IDC_GURGW_INPUT_BTN_APPLY                     = "套用"
IDC_GURGW_INPUT_BTN_DESIGN                    = "設計"
IDC_GURGW_INPUT_BTN_CHECK                     = "檢核"
IDC_GURGW_INPUT_BTN_REPORT                    = "報表 ..."
IDC_GURGW_CHECK_SHOW_ENDBAR                   = "Show end rebar controls"
IDC_GURGW_CHECK_SHOW_SEISMIC                  = "顯示耐震設計參數"
IDC_GURGW_FRM_EDITOPT                         = "編輯選項"
IDC_GURGW_EDTOPT_CHK_MATLFCK                  = "混凝土"
IDC_GURGW_EDTOPT_CHK_MATLFYR                  = "鋼筋"
IDC_GURGW_EDTOPT_CHK_SECTTHK                  = "厚度"
IDC_GURGW_EDTOPT_CHK_SECTLEN                  = "長度"
IDC_GURGW_EDTOPT_CHK_SPECIAL                  = "特殊牆"
IDC_GURGW_EDTOPT_CHK_BOUNDARY                 = "邊界構材"
IDC_GURGW_EDTOPT_CHK_PILOTIS                  = "Pilotis Design Guide"

////// IDD_URBB_SMART_DGN_OPTION_DLG
IDD_URBB_SMART_DGN_OPTION_DLG                 = "Smart Design Option ( Batch Beam )"

////// IDD_URBC_SMART_DGN_OPTION_DLG
IDD_URBC_SMART_DGN_OPTION_DLG                 = "Smart Design Option ( Batch Column )"
IDC_CHK_OPTN_STRY                             = "Apply Option by Story"
IDC_BTN_STORY_MOD                             = "Modify Option"
IDC_BTN_STORY_DEL                             = "Delete Option"

////// IDD_URBW_SMART_DGN_OPTION_DLG
IDD_URBW_SMART_DGN_OPTION_DLG                 = "Smart Design Option ( Batch Wall )"

////// IDD_RCS_BATCHWALL_OPTION_DLG
IDD_RCS_BATCHWALL_OPTION_DLG                  = "智能設計選項"
IDC_GURGW_OPTION_DGN_SECT_CHK                 = "依設計結果變更斷面"
IDC_GURGW_OPTION_DGN_SECT_D_CHK               = "最大厚度"
IDC_GURGW_OPTION_DGN_GEN_CHK                  = "使用Gen/ADS的設計方法"
IDC_GURGW_OPTION_DGN_GEN_LABEL                = "設計方法"
IDC_GURGW_OPTION_DGN_GEN_LABEL2               = "端部鋼筋數量"
IDC_GURGW_OPTION_ORD_TEXT                     = "設計選項"
IDC_GURGW_OPTION_ORD_RDO1                     = "同時滿足鋼筋需求面積與間距規則"
IDC_GURGW_OPTION_ORD_RDO2                     = "僅滿足鋼筋需求面積"
IDC_GURGW_OPTION_DGN_SPACE_CHK                = "輸入鋼筋間距"
IDC_GURGW_OPTION_FRM_VSPACE                   = "垂直鋼筋"
IDC_GURGW_OPTION_DGN_VSPACE_MIN_LABEL         = "最小值"
IDC_GURGW_OPTION_DGN_VSPACE_MAX_LABEL         = "最大值"
IDC_GURGW_OPTION_DGN_VSPACE_INC_LABEL         = "增量"
IDC_GURGW_OPTION_FRM_HSPACE                   = "水平鋼筋"
IDC_GURGW_OPTION_DGN_HSPACE_MIN_LABEL         = "最小值"
IDC_GURGW_OPTION_DGN_HSPACE_MAX_LABEL         = "最大值"
IDC_GURGW_OPTION_DGN_HSPACE_INC_LABEL         = "增量"
IDC_GURGW_OPTION_DGN_SPACE_EXP_LABEL          = "如""輸入鋼筋間距""選項未啟用，將會採用""鋼筋資訊""中的設計值"
IDC_GURGW_OPTION_CHK_MATL                     = "依鋼筋號數指派材料強度"
IDC_GURGW_OPTION_FRM_MATL_VBAR                = "垂直/端部鋼筋"
IDC_GURGW_OPTION_BTN_ADD_VBAR                 = "新增"
IDC_GURGW_OPTION_BTN_INS_VBAR                 = "插入"
IDC_GURGW_OPTION_BTN_DEL_VBAR                 = "刪除"
IDC_GURGW_OPTION_FRM_MATL_HBAR                = "水平鋼筋"
IDC_GURGW_OPTION_BTN_ADD_HBAR                 = "新增"
IDC_GURGW_OPTION_BTN_INS_HBAR                 = "插入"
IDC_GURGW_OPTION_BTN_DEL_HBAR                 = "刪除"
IDC_GURGW_OPTION_CHK_VBAR                     = "由樓層高度指派垂直鋼筋"
IDC_GURGW_OPTION_DGN_LBL_VBAR_H               = "當樓層高度  >"
IDC_GURGW_OPTION_DGN_LBL_VBAR_N               = "使用鋼筋"
IDC_GURGW_OPTION_BTN_DEFAULT                  = "回復預設值"
IDC_GURGW_OPTION_BTN_APPLY                    = "確認"
IDC_GURGW_OPTION_BTN_CANCEL                   = "取消"

////// IDD_RCS_BATCHWALL_WALL_DLG
IDD_RCS_BATCHWALL_WALL_DLG                    = "牆資料"
IDC_GURGW_WALL_ID                             = "牆ID"
IDC_GURGW_WALL_BTN_APPLY                      = "套用"
IDC_GURGW_WALL_BTN_CHECK                      = "檢核"
IDC_GURGW_WALL_BTN_CLOSE                      = "關閉"

/////// IDD_RCS_DESIGN_LOAD
IDD_RCS_DESIGN_LOAD                           = "設計載重"
IDC_RCS_DL_INFO_FRM_NAME                      = "名稱"
IDC_RCS_DL_NAME_DEL_BTN                       = "刪除"
IDC_RCS_DL_INFO_CAL_ALL_BTN                   = "計算 (全部)"
IDC_RCS_DL_INFO_APPL_CHK                      = "套用當前載重係數"
IDC_RCS_DL_INFO_FRM_LOAD                      = "載重資料"
IDC_RCS_DL_INFO_FRM_FACT                      = "載重係數"
IDC_RCS_DL_INFO_CODE_BTN                      = "依規範"
IDC_RCS_DL_INFO_FRM_DEAD                      = "靜載重"
IDC_RCS_DL_DEAD_ADD_BTN                       = "新增"
IDC_RCS_DL_DEAD_INS_BTN                       = "插入"
IDC_RCS_DL_DEAD_DEL_BTN                       = "刪除"
IDC_RCS_DL_INFO_FRM_LIVE                      = "活載重"
IDC_RCS_DL_INFO_FRM_DGNL                      = "設計載重"
IDC_RCS_DL_INFO_ADD_BTN                       = "新增"
IDC_RCS_DL_INFO_COP_BTN                       = "複製"
IDC_RCS_DL_INFO_MOD_BTN                       = "修改"
IDC_RCS_DL_INFO_CAL_BTN                       = "計算"
IDC_RCS_DL_INFO_LBL_NAME                      = "名稱"
IDC_RCS_DL_INFO_LBL_DEAD                      = "靜載"
IDC_RCS_DL_INFO_LBL_LIVE                      = "活載"
IDC_RCS_DL_INFO_LBL_LIVE2                     = "活載"
IDC_RCS_DL_INFO_LBL_TYPE1                     = "類別1"
IDC_RCS_DL_INFO_LBL_TYPE2                     = "類別2"
IDC_RCS_DL_INFO_LBL_DGND                      = "靜載"
IDC_RCS_DL_INFO_LBL_SERV                      = "使用載重"
IDC_RCS_DL_INFO_LBL_DGNL                      = "活載"
IDC_RCS_DL_INFO_LBL_FACT                      = "因數載重"

//RcsBeamlist_ExportDlg
IDC_GURBL_EXPORT_FRAME_LIST                   = "梁表格"
IDC_GURBL_EXPORT_BTN_UPDATE                   = "更新主筋"
IDC_GURBL_EXPORT_BTN_UPDATE_MBAR              = "更新主筋"
IDC_GURBL_EXPORT_BTN_UPDATE_SBAR              = "更新箍筋"
IDC_GURBL_EXPORT_BTN_CHEK                     = "選取"
IDC_GURBL_EXPORT_BTN_UNCHEKALL                = "全不選"
IDC_GURBL_EXPORT_BTN_CHEKAll                  = "全選"
IDC_GURBL_EXPORT_BTN_OK                       = "確認"
IDC_GURBL_EXPORT_BTN_CANCEL                   = "取消"
IDC_GURBL_EXPORT_STC_INFO                     = "彎矩 (φMn)"
IDC_MAIN_RBAR_STC                             = "主筋"
IDC_MAIN_RBAR_STC_MBAR                        = "主筋"
IDC_MAIN_RBAR_STC_SBAR                        = "箍筋"
IDC_TARGET_RATIO_STC                          = "目標比值"
IDC_GURBL_EXPORT_STC_CURR_RBAR                = "選取的鋼筋資料"

// RcsBeamlist_InputDlg
IDC_GURBL_FRAME_MATERIAL                      = "材料"
IDC_GURBL_CHECK_MATERIAL_LCON                 = "輕質混凝土"
IDC_GURBL_FRAME_SECTION                       = "斷面"
IDC_GURBL_FRAME_REBAR                         = "鋼筋"
IDC_GURBL_FRAME_LAYER                         = "單排主筋配置數量"
IDC_GURBL_CHK_LAYER_AUTO                      = "自動"
IDC_GURBL_FRAME_SPACE                         = "主筋豎向間距"
IDC_GURBL_CHK_SPACE_AUTO                      = "自動"
IDC_GURBL_FRAME_COMBAR                        = "壓力鋼筋"
IDC_GURBL_RADIO_COMBAR_NONE                   = "不考慮"
IDC_GURBL_RADIO_COMBAR_LAYER                  = "外側單排主筋"
IDC_GURBL_RADIO_COMBAR_RATIO                  = "壓力鋼筋比"
IDC_GURBL_FRAME_SPLICE                        = "主筋間距規則"
IDC_GURBL_RADIO_SPLICE000                     = "不考慮搭接"
IDC_GURBL_RADIO_SPLICE050                     = "50% 搭接"
IDC_GURBL_RADIO_SPLICE100                     = "100% 搭接"
IDC_GURBL_RADIO_CRACK_DRY                     = "Dry"
IDC_GURBL_RADIO_CRACK_ETC                     = "Etc"
IDC_GURBL_FRAME_RESULT                        = "檢核計算結果"
IDC_GURBL_LABEL_NAME                          = "構件名稱"
IDC_GURBL_LABEL_MATERIAL_FCK                  = "混凝土"
IDC_GURBL_LABEL_MATERIAL_FY                   = "主筋"
IDC_GURBL_LABEL_MATERIAL_FYS                  = "剪力筋"
IDC_GURBL_LABEL_SECTION_B                     = "寬度"
IDC_GURBL_LABEL_SECTION_H                     = "高度"
IDC_GURBL_LABEL_SECTION_CC                    = "保護層厚度"
IDC_GURBL_LABEL_USE_TYPE                      = "套用此構件於 "
IDC_GURBL_LABEL_MAINBAR                       = "主筋"
IDC_GURBL_LABEL_STIRRUP                       = "肋筋"
IDC_GURBL_LABEL_LAYER                         = "主筋設置排數"
IDC_GURBL_LABEL_LAYER_NO                      = "EA / 排"
IDC_GURBL_LABEL_MATERIAL_FACT                 = "因數"
IDC_GURBL_FRAME_CRACK                         = "裂縫控制"
IDC_GURBL_LABEL_RESULT_M                      = "撓曲強度"
IDC_GURBL_LABEL_RESULT_V                      = "剪力強度"

// RcsShearWallForceDlg
IDC_RCS_WALL_FORCE_LABEL_NOTICE               = "執行設計/檢核後，LCB1將由主控的載重組合取代"
IDC_RCS_WALL_FORCE_BTN_ADD                    = "&新增"
IDC_RCS_WALL_FORCE_BTN_INS                    = "&插入"
IDC_RCS_WALL_FORCE_BTN_DEL                    = "&刪除"
IDC_RCS_WALL_FORCE_BTN_OK                     = "&確認"
IDC_RCS_WALL_FORCE_BTN_CANCEL                 = "&取消"

//RcsShearWallInputDlg
IDC_GURSW_FRAME_MATERIAL                      = "材料 (基本)"
IDC_GURSW_LABEL_MATERIAL_FCK                  = "混凝土"
IDC_GURSW_LABEL_MATERIAL_MB                   = "垂直筋"
IDC_GURSW_LABEL_MATERIAL_HB                   = "水平筋"
IDC_GURSW_FRAME_MATERIAL2                     = "材料 (因數)"
IDC_GURSW_CHECK_MATERIAL_LCON                 = "輕質混凝土"
IDC_GURSW_LABEL_MATERIAL_FACT                 = "因數"
IDC_GURSW_FRAME_DIMENSION                     = "斷面"
IDC_GURSW_LABEL_SECTION_THICKNESS             = "厚度"
IDC_GURSW_LABEL_SECTION_LENGTH                = "長度"
IDC_GURSW_LABEL_SECTION_COVER                 = "保護層厚度"
IDC_GURSW_LABEL_SECTION_HEIGHT_X              = "無支撐長度 (x)"
IDC_GURSW_LABEL_SECTION_HEIGHT_Y              = "無支撐長度 (y)"
IDC_GURSW_LABEL_KFACTOR_X                     = "Kx"
IDC_GURSW_LABEL_KFACTOR_Y                     = "Ky"
IDC_GURSW_CHECK_WEAK_BENDING                  = "檢核弱軸彎矩"
IDC_GURSW_FRAME_FORCE                         = "軸力&&彎矩"
IDC_GURSW_LABEL_FORCE_AXIAL                   = "軸力"
IDC_GURSW_LABEL_FORCE_MOMENT_X                = "彎矩 (x)"
IDC_GURSW_LABEL_FORCE_MOMENT_Y                = "彎矩 (y)"
IDC_GURSW_CHECK_APPLY2SHEAR                   = "考慮軸力對剪力強度影響"
IDC_GURSW_FRAME_SHEAR                         = "剪力"
IDC_GURSW_LABEL_FORCE_SHEAR_Y                 = "剪力 (y)"
IDC_GURSW_LABEL_FORCE_AXIAL_Y                 = "軸力 (y)"
IDC_GURSW_LABEL_FORCE_MOMENT_X_SHEAR          = "彎矩 (x)"
IDC_GURSW_FRAME_FACTOR                        = "因數"
IDC_GURSW_LABEL_FACTOR_CMX                    = "Cmx"
IDC_GURSW_LABEL_FACTOR_CMY                    = "Cmy"
IDC_GURSW_LABEL_FACTOR_BETAD                  = "βd"
IDC_GURSW_BTN_LCOMB                           = "載重組合 ..."
IDC_GURSW_FRAME_ARRANGE                       = "鋼筋配置"
IDC_GURSW_FRAME_REBAR                         = "鋼筋"
IDC_GURSW_FRAME_SEISMIC                       = "耐震設計"
IDC_GURSW_CHECK_SEISMIC_SPECIAL               = "套用耐震設計特別規定"
IDC_GURSW_RADIO_SPECIAL_MOMENT                = "特殊牆"
IDC_GURSW_RADIO_INTERMEDIATE_MOMENT           = "中級牆"
IDC_GURSW_INPUT_BTN_SEISMIC                   = "設計參數..."
IDC_GURSW_FRAME_PM_CURVE                      = "PM 曲線"
IDC_GURSW_LABEL_PMCURVE                       = "選擇繪製軸向 :"
IDC_GURSW_RADIO_PMCURVE_X                     = "主軸 (X)"
IDC_GURSW_RADIO_PMCURVE_Y                     = "弱軸 (Y)"
IDC_GURSW_FRAME_CHECKITEM                     = "檢核計算結果"

//RcsShearWallSeismicDlg
IDC_GURSW_SEISMIC_CHK_BELEM                   = "邊界構材"
IDC_GURSW_SEISMIC_BTN_APPLY                   = "&套用"
IDC_GURSW_SEISMIC_BTN_CLOSE                   = "&關閉"
IDC_GURSW_SPECSIOAL_SHEAR_WALL                = "特殊結構牆"
IDC_GURSW_SEISMIC_LBL_WALLH                   = "总高度"
IDC_GURSW_SEISMIC_LBL_FORCE                   = "Pu"

//RcsShearWallSimpleInputRebarDlg
IDC_GURSW_FRAME_MAINBAR                       = "鋼筋"
IDC_GURSW_LABEL_UNIT2                         = "單位 : "
IDC_GURSW_LABEL_UNIT                          = "單位"
IDC_GURSW_LABEL_VERBAR_NO                     = "垂直筋"
IDC_GURSW_LABEL_HORBAR_NO                     = "水平筋"
IDC_GURSW_LABEL_ENDBAR_NO                     = "端部垂直筋"
IDC_GURSW_LABEL_BEBAR                         = "端部水平筋"

// RcsStairSimpleInputRBarDlg
IDC_GURST_LABEL_BAR_NAME                      = "最小鋼筋號數"
IDC_GURST_FRAME_REBAR                         = "鋼筋"
IDC_GURST_LABEL_BAR_NO                        = "鋼筋支數"
IDC_GURST_FRAME_PREVIEW                       = "預覽 (剖面 && 示意圖)"
IDC_GURST_LABEL_PREVIEW_ITEM                  = "顯示內容 :"
IDC_GURST_TABLE_USE_LEFT                      = "同左側"

// RcsStairSimpleInputSectDlg
IDC_GURST_CHECK_MATERIAL_LCON                 = "輕質混凝土"
IDC_GURST_RADIO_SUPPORT_BY_LANDING            = "於平台"
IDC_GURST_RADIO_SUPPORT_BY_OTHERS             = "於牆或梁"
IDC_GURST_RADIO_CRACK_DRY                     = "Dry"
IDC_GURST_RADIO_CRACK_ETC                     = "Etc"
IDC_GURST_FRAME_MATERIAL                      = "材料"
IDC_GURST_LABEL_MATERIAL_FCK                  = "混凝土"
IDC_GURST_LABEL_MATERIAL_FY                   = "主筋"
IDC_GURST_LABEL_DL_STAIR                      = "靜載 (階梯)"
IDC_GURST_LABEL_DL_LANDING                    = "靜載 (平台)"
IDC_GURST_LABEL_LIVE_LOAD                     = "活載重"
IDC_GURST_FRAME_SUPPORT                       = "支撐"
IDC_GURST_LABEL_SUPPORT_R                     = "右側"
IDC_GURST_LABEL_SUPPORT_L                     = "左側"
IDC_GURST_FRAME_THICK                         = "厚度"
IDC_GURST_LABEL_THICK_STAIR                   = "階梯"
IDC_GURST_LABEL_THICK_LANDING                 = "平台"
IDC_GURST_LABEL_THICK_COVER                   = "保護層厚度"
IDC_GURST_FRAME_LENGTH                        = "長度"
IDC_GURST_LABEL_LENGTH_LANDING_L              = "平台 (L)"
IDC_GURST_LABEL_LENGTH_LANDING_R              = "平台 (R)"
IDC_GURST_LABEL_LENGTH_STAIR                  = "階梯"
IDC_GURST_FRAME_SIZE                          = "尺寸"
IDC_GURST_LABEL_SIZE_HEIGHT                   = "高度"
IDC_GURST_LABEL_SIZE_WIDTH                    = "寬度"
IDC_GURST_LABEL_MATERIAL_FACT                 = "因數"
IDC_GURST_FRAME_CRACK                         = "裂縫控制"

//RcsStair_InputDlg
IDC_GURST_CHECK_END_REBAR                     = "使用端部鋼筋"

/////// IDD_RCS_COLM_GEN_FORCE_DLG_EC
IDD_RCS_COLM_GEN_FORCE_DLG_EC                 = "載重組合"
IDC_RCS_COLGEN_FORCE_BTN_ALL                  = "&全選"
IDC_RCS_COLGEN_FORCE_BTN_NON                  = "&全不選"
IDC_RCS_COLGEN_FORCE_BTN_INV                  = "&反選"
IDC_RCS_COLGEN_FORCE_BTN_ADD                  = "&新增"
IDC_RCS_COLGEN_FORCE_BTN_INS                  = "&插入"
IDC_RCS_COLGEN_FORCE_BTN_DEL                  = "&刪除"
IDC_RCS_COLGEN_FORCE_BTN_OK                   = "&確認"
IDC_RCS_COLGEN_FORCE_BTN_CANCEL               = "&取消"

/////// IDD_RCS_URGC_MATL_DLG
IDC_GURGC_FRAME_MATERIAL                      = "材料"
IDC_GURGC_LABEL_MATERIAL_FCK                  = "混凝土"
IDC_GURGC_LABEL_MATERIAL_MB                   = "主筋"
IDC_GURGC_LABEL_MATERIAL_HB                   = "箍筋"
IDC_GURGC_CHECK_MATERIAL_LCON                 = "輕質混凝土"
IDC_GURGC_LABEL_MATERIAL_FACT                 = "因數"
IDC_GURGC_FRAME_LENGTH                        = "設計參數"
IDC_GURGC_LABEL_LENGTH_X                      = "無支撐長度 (x)"
IDC_GURGC_LABEL_LENGTH_Y                      = "無支撐長度 (y)"
IDC_GURGC_LABEL_KFACTOR_X                     = "Kx"
IDC_GURGC_LABEL_KFACTOR_Y                     = "Ky"
IDC_GURGC_FRAME_SPLICE                        = "主筋間距規則"
IDC_GURGC_RADIO_SPLICE000                     = "不考慮搭接"
IDC_GURGC_RADIO_SPLICE050                     = "50% 搭接"
IDC_GURGC_RADIO_SPLICE100                     = "100% 搭接"
IDC_GURGC_FRAME_EFF_AREA                      = "轉換等值面積"
IDC_GURGC_LABEL_EFF_AREA_B                    = "寬度 (B)"
IDC_GURGC_LABEL_EFF_AREA_H                    = "深度 (H)"
IDC_GURGC_BTN_EFF_AREA_CALC                   = "依斷面資料計算"
IDC_GURGC_SLEN_IMPER_CHK                      = "考慮缺陷效應"
IDC_GURGC_SLEN_2ND_CHK                        = "考慮二階效應"
IDC_GURGC_SLEN_CHK_A                          = "由程式計算"
IDC_GURGC_SLEN_CHK_B                          = "由程式計算"
IDC_GURGC_SLEN_CHK_C                          = "由程式計算"

/////// IDD_RCS_URGC_FORC_DLG
IDC_GURGC_FRAME_COVER                         = "保護層厚度"
IDC_GURGC_LABEL_COVER                         = "保護層厚度"
IDC_GURGC_FRAME_HOOPBAR                       = "箍筋"
IDC_GURGC_LABEL_UNIT2                         = "單位 : "
IDC_GURGC_LABEL_UNIT                          = "單位"
IDC_GURGC_LABEL_HOOP_END                      = "端部"
IDC_GURGC_LABEL_HOOP_CEN                      = "中央"
IDC_GURGC_CHECK_HOOP_USER                     = "自定義參數"
IDC_GURGC_FRAME_TIEBAR                        = "箍筋"
IDC_GURGC_CHECK_TIEBAR                        = "併入剪力強度計算"
IDC_GURGC_LABEL_TIEBAR_MATL                   = "材料"
IDC_GURGC_LABEL_TIEBAR_RBAR                   = "鋼筋"
IDC_GURGC_LABEL_TIEBAR_NOX                    = "No.(x)"
IDC_GURGC_LABEL_TIEBAR_NOY                    = "No.(y)"
IDC_GURGC_FRAME_FORCE_FACTOR                  = "外力&&參數"
IDC_GURGC_FRAME_FORCE                         = "軸力&&彎矩"
IDC_GURGC_LABEL_FORCE_AXF                     = "軸力"
IDC_GURGC_LABEL_FORCE_MEMX                    = "彎矩 (x)"
IDC_GURGC_LABEL_FORCE_MEMY                    = "彎矩 (y)"
IDC_GURGC_FRAME_SHEAR                         = "剪力"
IDC_GURGC_LABEL_FORCE_AXIAL_X                 = "軸力 (x)"
IDC_GURGC_LABEL_FORCE_SHX                     = "剪力 (x)"
IDC_GURGC_LABEL_FORCE_AXIAL_Y                 = "軸力 (y)"
IDC_GURGC_LABEL_FORCE_SHY                     = "剪力 (y)"
IDC_GURGC_FRAME_COE                           = "係數"
IDC_GURGC_LABEL_COE_CMX                       = "Cmx"
IDC_GURGC_LABEL_COE_CMY                       = "Cmy"
IDC_GURGC_LABEL_COE_BETAD                     = "βd"
IDC_GURGC_BTN_LCOMB                           = "載重組合 ..."

/////// RcsGenColmInputSect2Dlg_EC
IDC_GURGC_CHECK_APPLY2SHEAR                   = "考慮軸力對剪力強度影響"
IDC_GURGC_LABEL_FORCE_MEMXI                   = "彎矩 (xi)"
IDC_GURGC_LABEL_FORCE_MEMXJ                   = "彎矩 (xj)"
IDC_GURGC_LABEL_FORCE_MEMYI                   = "彎矩 (yi)"
IDC_GURGC_LABEL_FORCE_MEMYJ                   = "彎矩 (yj)"
IDC_GURGC_FRAME_COE_EC                        = "有效潛變比"
IDC_GURGC_CREEP_COEFFICIENT_STC               = "比值"

/////// IDD_RCS_URGC_RBAR_DLG
IDC_GURGC_FRAME_SECT_VIEW                     = "斷面"
IDC_GURGC_BTN_SECT_IMPORT                     = "匯入..."
IDC_GURGC_BTN_SECT_IMPORT_SHORT               = "匯入..."
IDC_GURGC_FRAME_MAINBAR                       = "主筋"
IDC_GURGC_LABEL_MAIN_BAR                      = "主筋"
IDC_GURGC_FRAME_SECT_INFOR                    = "斷面資料"
IDC_GURGC_RADIO_SECT_INFOR_SHAPE              = "形狀"
IDC_GURGC_RADIO_SECT_INFOR_MAINBAR            = "主筋"
IDC_GURGC_RADIO_SECT_INFOR_TIEBAR             = "箍筋"
IDC_GURGC_CHECK_SECT_INFOR_INDEX              = "顯示編號"
IDC_GURGC_STC_SECT_INFOR_MIN_SPACE            = "最小主筋間距: "
IDC_GURGC_STC_SECT_INFOR_INSERT_KEY           = "鍵盤""Insert""鍵 : 於選取的儲存格位置插入新列"

/////// IDD_RCS_URGC_MLIST_COLM_DLG
IDD_RCS_URGC_MLIST_COLM_DLG                   = "斷面資料"
IDC_GURGC_SEL_COLM_CURRENT_STC                = "當前構件"
IDC_GURGC_SEL_COLM_SELECT_STC                 = "選擇構件"
IDC_GURGC_SEL_COLM_BTN_ALL                    = "全選"
IDC_GURGC_SEL_COLM_BTN_NON                    = "全不選"
IDC_GURGC_SEL_COLM_BTN_INV                    = "反選"
IDC_GURGC_SEL_COLM_SECTION_STC                = "斷面資料"
IDC_GURGC_SEL_COLM_OK_BTN                     = "確認"
IDC_GURGC_SEL_COLM_CANCEL_BTN                 = "取消"

/////// IDD_RCS_URGC_PMODE_DLG
IDC_GURGC_RADIO_SECT_VIEW_SECTION             = "斷面"
IDC_GURGC_RADIO_SECT_VIEW_PM_2D               = "PM 曲線"
IDC_GURGC_RADIO_SECT_VIEW_MM_2D               = "MM 曲線"
IDC_GURGC_LABEL_MAIN_BAR2                     = "-"
IDC_GURGC_FRAME_RESULT                        = "檢核計算結果"

//// IDD_RCS_BASEWALL_INPUT_DLG
IDC_GURBW_RADIO_TYPE_1WAY                     = "單向版"
IDC_GURBW_RADIO_TYPE_2WAY                     = "雙向版"
IDC_GURBW_BTN_SECTION_ADD                     = "新增"
IDC_GURBW_BTN_SECTION_DEL                     = "刪除"
IDC_GURBW_BTN_SECTION_IST                     = "插入"
IDC_GURBW_RADIO_CRACK_DRY                     = "Dry"
IDC_GURBW_RADIO_CRACK_ETC                     = "Etc"
IDC_GURBW_CHK_ANAL_OPT_AUTO                   = "自動"
IDC_GURBW_FRAME_DRAW                          = "預覽 (鋼筋 && 示意圖)"
IDC_GURBW_CHECK_PREVIEW_MESHLINE              = "網格線"
IDC_GURBW_CHECK_PREVIEW_CONTOUR               = "等值線"
IDC_GURBW_CHECK_PREVIEW_VALUE                 = "數值"
IDC_GURBW_LABEL_FONT_SIZE                     = "字體大小 :"
IDC_GURBW_BUTTON_REBAR_UPDATE                 = "更新鋼筋資料 (B1)"
IDC_GURBW_INPUT_BTN_REPORT                    = "報表 ..."
IDC_GURBW_LABEL_VO_ITD                        = "選擇顯示內容 :"
IDC_GURBW_FRAME_MATERIAL                      = "材料"
IDC_GURBW_FRAME_SECTION                       = "斷面"
IDC_GURBW_FRAME_LOAD                          = "Static Load"
IDC_GURBW_FRAME_SEIS                          = "Seismic Load"
IDC_GURBW_CHECK_LOAD                          = "Apply Static Pressure Load"
IDC_GURBW_CHECK_SEIS                          = "Apply Seismic Pressure Load"
IDC_GURBW_FRAME_BC                            = "邊界條件"
IDC_GURBW_FRAME_ANAL_OPT                      = "分析選項"
IDC_GURBW_LABEL_MATERIAL_FCK                  = "混凝土"
IDC_GURBW_LABEL_MATERIAL_MB                   = "主筋"
IDC_GURBW_LABEL_NAME                          = "構件名稱"
IDC_GURBW_LABEL_MATERIAL_SB                   = "剪力筋"
IDC_GURBW_LABEL_SECTION_COVER                 = "保護層厚度"
IDC_GURBW_LABEL_SECTION_WIDTH                 = "寬度"
IDC_GURBW_LABEL_BC_BOT                        = "下方"
IDC_GURBW_LABEL_BC_RIT                        = "右側"
IDC_GURBW_LABEL_ANAL_OPT_MESHSIZE             = "網格尺寸"
IDC_GURBW_LABEL_BC_LFT                        = "左側"
IDC_GURBW_LABEL_BC_TOP                        = "上方"
IDC_GURBW_LABEL_VO_STS                        = "顯示樓層 :"
IDC_GURBW_LABEL_SECTION_TYPE                  = "型式"
IDC_GURBW_FRAME_REBAR                         = "鋼筋配置"
IDC_GURBW_LABEL_REBAR_MOMENT                  = "彎矩"
IDC_GURBW_LABEL_REBAR_SHEAR                   = "剪力"
IDC_GURBW_LABEL_MATERIAL_FACT                 = "因數"
IDC_GURBW_FRAME_CRACK                         = "裂縫控制"

//// IDD_RCS_BASEWALL_SMODE_INPUT_REBAR_DLG
IDC_GURBW_LABEL_UNIT2                         = "單位 :"
IDC_GURBW_LABEL_UNIT                          = "單位"
IDC_GURBW_FRAME_REPORT_OPTION                 = "報表選項"
IDC_GURBW_LABEL_REBAR_ININO                   = "鋼筋支數"

///// IDD_RCS_BASEWALL_SMODE_INPUT_SECT_DLG
IDC_GURBW_CHECK_MATERIAL_LCON                 = "輕質混凝土"

/////// IDD_RCS_BASEWALL_LIST_REBAR_DLG
IDD_RCS_BASEWALL_LIST_REBAR_DLG               = "鋼筋資料"
IDC_GURBW_FRAME_SELECT_MEMBER                 = "選擇構件"
IDC_GURBW_SELECT_BTN_ALL                      = "全選"
IDC_GURBW_SELECT_BTN_NONE                     = "全不選"
IDC_GURBW_FRAME_REBAR_INFO                    = "鋼筋資料"
IDC_GURBW_FRAME_MOMENT                        = "彎矩"
IDC_GURBW_FRAME_SHEAR                         = "剪力"
IDC_GURBW_SOIL_BTN_APPLY                      = "套用"
IDC_GURBW_SOIL_BTN_CANCEL                     = "取消"

//// IDD_RCS_BASEWALL_LIST_STORY_DLG
IDD_RCS_BASEWALL_LIST_STORY_DLG               = "樓層資料"
IDC_GURBW_FRAME_STORY                         = "樓層"
IDC_GURBW_SOIL_BTN_ADD                        = "新增"
IDC_GURBW_SOIL_BTN_DEL                        = "刪除"
IDC_GURBW_SOIL_BTN_IST                        = "插入"

/// IDD_RCS_IMPORT_CAD_DLG
IDD_RCS_IMPORT_CAD_DLG                        = "Import AutoCAD File"
IDC_CAD_FILE_NAME_STC                         = "CAD檔案名稱 :"
IDC_CAD_FILE_BTN                              = "瀏覽..."
IDC_CAD_ALL_STC                               = "所有圖層"
IDC_CAD_FOOTING_STC                           = "基礎版圖層"
IDC_CAD_FOOTING_ADD_BTN                       = "->"
IDC_CAD_FOOTING_DEL_BTN                       = "<-"
IDC_CAD_PILE_STC                              = "樁基礎圖層"
IDC_CAD_PILE_ADD_BTN                          = "->"
IDC_CAD_PILE_DEL_BTN                          = "<-"
IDC_CAD_COLUMN_STC                            = "柱圖層"
IDC_CAD_COLUMN_ADD_BTN                        = "->"
IDC_CAD_COLUMN_DEL_BTN                        = "<-"
IDC_CAD_OK_BTN                                = "確認"
IDC_CAD_CANCEL_BTN                            = "取消"
IDC_CAD_SECTION_STC                           = "斷面圖層"
IDC_CAD_SECTION_ADD_BTN                       = "->"
IDC_CAD_SECTION_DEL_BTN                       = "<-"
IDC_CAD_REBAR_STC                             = "鋼筋圖層"
IDC_CAD_REBAR_ADD_BTN                         = "->"
IDC_CAD_REBAR_DEL_BTN                         = "<-"

/// IDD_RCS_RETAINING_WALL_INPUT_BASIC_DLG
IDC_GURRW_MATL_GRP                            = "材料"
IDC_GURRW_MATL_FCK_STC                        = "混凝土"
IDC_GURRW_MATL_MB_STC                         = "主筋"
IDC_GURRW_MATL_SB_STC                         = "剪力筋"
IDC_GURRW_MATL_LCON_CHK                       = "輕質混凝土"
IDC_GURRW_MATL_FACT_STC                       = "因數"
IDC_GURRW_INFO_GRP                            = "基本資料"
IDC_GURRW_INFO_TYPE_STC                       = "擋土牆型式"
IDC_GURRW_INFO_TOTAL_H_STC                    = "牆總高度"
IDC_GURRW_STEM_GRP                            = "牆身"
IDC_GURRW_STEM_TOP_THK_STC                    = "牆頂厚度"
IDC_GURRW_STEM_BOT_THK_STC                    = "牆底寬度"
IDC_GURRW_STEM_BACK_SLOPE_STC                 = "牆面背斜距離"
IDC_GURRW_STEM_COVER_FRONT_STC                = "保護層厚度 ( 正面 )"
IDC_GURRW_STEM_COVER_BACK_STC                 = "保護層厚度 ( 背面 )"
IDC_GURRW_FDN_GRP                             = "基礎版"
IDC_GURRW_FDN_DEPTH_STC                       = "底版厚度"
IDC_GURRW_FDN_SLOPE_DEPTH_STC                 = "斜部厚度"
IDC_GURRW_FDN_TOE_LENG_STC                    = "牆前趾寬度"
IDC_GURRW_FDN_HEEL_LENG_STC                   = "牆後踵寬度"
IDC_GURRW_FDN_COVER_STC                       = "保護層厚度"
IDC_GURRW_SKEY_GRP                            = "剪力榫"
IDC_GURRW_SKEY_USE_CHK                        = "是否設置剪力榫"
IDC_GURRW_SKEY_LOCATION_STC                   = "位置"
IDC_GURRW_SKEY_HEIGHT_STC                     = "深度"

///// IDD_RCS_RETAINING_WALL_INPUT_DLG
IDC_GURRW_FRAME_DRAW                          = "預覽"
IDC_GURRW_FRAME_STABILITY_RESULT              = "穩定性檢核計算結果"
IDC_GURRW_FRAME_REBAR                         = "鋼筋配置"
IDC_GURRW_INPUT_BTN_REPORT                    = "報表 ..."
IDC_GURRW_LABEL_VO_ITD                        = "選擇顯示內容 :"

////// IDD_RCS_RETAINING_WALL_SMODE_REBAR_DLG
IDC_GURRW_RBAR_STEM_GRP                       = "牆身鋼筋"
IDC_GURRW_RBAR_STEM_VFRONT                    = "垂直筋 ( 正面 )"
IDC_GURRW_RBAR_STEM_VBACK_STC                 = "垂直筋 ( 背面 )"
IDC_GURRW_RBAR_STEM_HORZ_STC                  = "水平筋"
IDC_GURRW_RBAR_FDN_GRP                        = "基礎鋼筋"
IDC_GURRW_RBAR_FDN_TOE_STC                    = "牆前趾鋼筋 ( 底部 )"
IDC_GURRW_RBAR_FDN_HEEL_STC                   = "牆後踵鋼筋 ( 頂部 )"
IDC_GURRW_RBAR_FDN_DIST_STC                   = "水平溫度筋"
IDC_GURRW_RBAR_SKEY_GRP                       = "剪力榫"
IDC_GURRW_RBAR_SKEY_VERT_STC                  = "垂直筋"

///// IDD_RCS_RETAINING_WALL_INPUT_SOILLOAD_DLG
IDC_GURRW_BACKFILL_GRP                        = "牆背回填土性質"
IDC_GURRW_BACKFILL_INCLINE_CHK                = "考慮牆背地表傾角"
IDC_GURRW_BACKFILL_SLOPE_STC                  = "斜率  =  1:"
IDC_GURRW_BACKFILL_HEIGHT_STC                 = "高度"
IDC_GURRW_BACKFILL_PHI_STC                    = "摩擦角"
IDC_GURRW_BACKFILL_DENSITY_STC                = "土單位重"
IDC_GURRW_SURCHARGE_GRP                       = "坡頂超載"
IDC_GURRW_BACKFILL_SUR_FLAT_STC               = "平面段"
IDC_GURRW_BACKFILL_SUR_SLOPE_STC              = "傾斜段"
IDC_GURRW_FDN_GRND_GRP                        = "下方原土層性質"
IDC_GURRW_FDN_GRND_PHI_STC                    = "摩擦角"
IDC_GURRW_FND_GRND_C_STC                      = "凝聚力"
IDC_GURRW_FDN_GRND_QA_STC                     = "承載力"
IDC_GURRW_LOAD_GRP                            = "外力"
IDC_GURRW_LOAD_SOIL_FACT_STC                  = "土壓載重係數"
IDC_GURRW_LOAD_WATER_LELVE_STC                = "地下水位高"
IDC_GURRW_LOAD_WALTER_FACT_STC                = "水壓載重係數"
IDC_GURRW_FRNTFILL_GRP                        = "Front Fill"
IDC_GURRW_FRNTFILL_CONSIDER_CHK               = "Consider Front Fill"

// IDD_RCS_FOOT_PMODE_DLG
IDC_GUFDN_CHECK_MATERIAL_LCON                 = "輕質混凝土"
IDC_GUFDN_INPUT_BTN_LCOMB_SERV                = "載重組合 ..."
IDC_GUFDN_INPUT_BTN_LCOMB_FACT                = "載重組合 ..."
IDC_GURFD_CHK_DLOAD_SW                        = "計算基礎自重"
IDC_GURFD_INPUT_BTN_SWITCH                    = "Mx <-> My"
IDC_GURFD_LABEL_FD_TYPE                       = "類型"
IDC_GURFD_LABEL_FD_THICKNESS                  = "厚度"
IDC_GURFD_LABEL_FD_COVER                      = "保護層厚度"
IDC_GURFD_RADIO_RECTANGLE                     = "矩形"
IDC_GURFD_RADIO_CIRCLE                        = "圓形"
IDC_GURFD_FRAME_REBAR                         = "鋼筋"
IDC_GURFD_FRAME_ARRANGE_X                     = "鋼筋配置方式 (X方向)"
IDC_GURFD_FRAME_FOUND_SIZE                    = "基礎版尺寸"
IDC_GURFD_FRAME_ARRANGE_Y                     = "鋼筋配置方式 (Y方向)"
IDC_GURFD_FRAME_ARRANGE_ETC                   = "檢核計算結果"
IDC_GURFD_FRAME_MATERIAL                      = "材料"
IDC_GURFD_LABEL_MATERIAL_FCK                  = "混凝土"
IDC_GURFD_LABEL_MATERIAL_MB                   = "主筋"
IDC_GURFD_FRAME_DESIGN_LOAD                   = "設計載重"
IDC_GURFD_LABEL_DLOAD_PS                      = "Ps"
IDC_GURFD_LABEL_DLOAD_MSX                     = "Msx"
IDC_GURFD_LABEL_DLOAD_MSY                     = "Msy"
IDC_GURFD_LABEL_DLOAD_PU                      = "Pu"
IDC_GURFD_LABEL_DLOAD_MUX                     = "Mux"
IDC_GURFD_LABEL_DLOAD_MUY                     = "Muy"
IDC_GURFD_FRAME_SURCHARGE_LOAD                = "外加荷載"
IDC_GURFD_LABEL_SLOAD_SL                      = "地面超載"
IDC_GURFD_LABEL_SLOAD_WD                      = "土單位重"
IDC_GURFD_LABEL_SLOAD_H                       = "覆土深度"
IDC_GURFD_FRAME_FOUNDATION                    = "基礎版"
IDC_GURFD_FRAME_COLUMN_SECTION                = "柱斷面"
IDC_GURFD_LABEL_CS_CX                         = "Cx"
IDC_GURFD_LABEL_CS_CY                         = "Cy"
IDC_GURFD_LABEL_CS_EX                         = "Ex"
IDC_GURFD_LABEL_CS_EY                         = "Ey"
IDC_GUFDN_LABEL_MATERIAL_FACT                 = "因數"
IDC_GURFD_LABEL_COLMPOS_TYPE                  = "位置"
IDC_GURFD_FRAME_SHFOROPT                      = "剪力選項"
IDC_GUFDN_CHECK_SHFOR_SURCHARGE               = "包含外加荷載"

// IDD_RCS_FOUNDATION_SMODE_SECT_DLG_EC
IDC_GURFD_LABEL_DLOAD_NS                      = "N.Ed.s"
IDC_GURFD_LABEL_DLOAD_MSXS                    = "M.Ed.sx"
IDC_GURFD_LABEL_DLOAD_MSYS                    = "M.Ed.sy"
IDC_GURFD_LABEL_DLOAD_NU                      = "N.Ed.u"
IDC_GURFD_LABEL_DLOAD_MUXS                    = "M.Ed.ux"
IDC_GURFD_LABEL_DLOAD_MUYS                    = "M.Ed.uy"

// IDD_RCS_FOUNDATION_INPUT_DLG_EC
IDC_GURFD_LABEL_DLOAD_EC_PS                   = "N.Ed.s"
IDC_GURFD_LABEL_DLOAD_EC_MSX                  = "M.Ed.sx"
IDC_GURFD_LABEL_DLOAD_EC_MSY                  = "M.Ed.sy"
IDC_GURFD_LABEL_DLOAD_EC_PU                   = "N.Ed.u"
IDC_GURFD_LABEL_DLOAD_EC_MUX                  = "M.Ed.ux"
IDC_GURFD_LABEL_DLOAD_EC_MUY                  = "M.Ed.uy"

// IDD_RCS_FOUNDATION_LIST_DLG_EC
IDC_GUFDN_LIST_RADIO_MAT                      = "獨立基礎"
IDC_GUFDN_LIST_RADIO_PILE                     = "樁基礎"
IDC_GUFDN_LIST_LBL_FOOT                       = "類型"
IDC_GUFDN_LIST_RADIO_STRIP                    = "連續基礎"

// IDD_RCS_FOOT_RBAR_DLG
IDC_GURFD_FRAME_PROPERTY                      = "性質"
IDC_GURFD_FRAME_RBAR                          = "鋼筋"
IDC_GURFD_LABEL_RBAR_INIT_X                   = "最小鋼筋號數 (x)"
IDC_GURFD_LABEL_RBAR_INIT_Y                   = "最小鋼筋號數 (Y)"
IDC_GURFD_LABEL_BAR_NO                        = "鋼筋支數"

// IDD_RCS_FOUNDATION_SMODE_RBAR_DLG_EC
IDC_GURFD_RADIO_STRIP                         = "連續基礎"

// IDD_RCS_BUTTRESS_LIST_REBAR_DLG
IDD_RCS_BUTTRESS_LIST_REBAR_DLG               = "鋼筋資料"
IDC_GURBU_SELECT_MEMBER_FRM                   = "選擇構件"
IDC_GURBU_SELECT_BTN_ALL                      = "全選"
IDC_GURBU_SELECT_BTN_NONE                     = "全不選"
IDC_GURBU_REBAR_INFO_FRM                      = "鋼筋資料"
IDC_GURBU_FRAME_REBAR                         = "鋼筋"
IDC_GURBU_LABEL_BARTYPE                       = "鋼筋配置方式"
IDC_GURBU_FRAME_PREVIEW_OPTION                = "Preview Option"
IDC_GURBU_RADIO_REBAR_TYPE1                   = "類型-1 (全斷面)"
IDC_GURBU_RADIO_REBAR_TYPE2                   = "類型-2 (端部 && 中央)"
IDC_GURBU_RADIO_REBAR_TYPE3                   = "類型-3 (兩端 && 中央)"
IDC_GURBU_FRAME_SKINBAR                       = "腰筋"
IDC_GURBU_CHECK_DISTRIBUTE                    = "兩側均勻分佈"
IDC_GURBU_STORY_FRM                           = "樓層"
IDC_GURBU_SOIL_BTN_APPLY                      = "套用"
IDC_GURBU_SOIL_BTN_CANCEL                     = "取消"
IDC_GURBU_LABEL_SKINBAR                       = "腰筋"
IDC_GURBU_LABEL_SKINBAR2                      = "-"
IDC_GURBU_LABEL_STORY                         = "顯示樓層 :"

// IDD_RCS_BUTTRESS_SUPPORT_DLG
IDD_RCS_BUTTRESS_SUPPORT_DLG                  = "Support Condition of Basement Wall"
IDC_GURBU_FRM_SUPPORT_WALL                    = "Support Condition of Basement Wall"

// IDD_RCS_BUTTRESS_SMODE_INPUT_DLG
IDC_GURBU_LABEL_FONT_SIZE                     = "字體大小"
IDC_GURBU_INPUT_BTN_REPORT                    = "報表 ..."

// IDD_RCS_BUTTRESS_SMODE_REBAR_DLG
IDC_GURBU_LABEL_LAYER_NO                      = "最大鋼筋排數"
IDC_GURBU_LABEL_UNIT2                         = "單位 :"
IDC_GURBU_LABEL_UNIT                          = "單位"
IDC_GURBU_FRAME_REPORT_OPTION                 = "報表選項"
IDC_GURBU_CHECK_PREVIEW_MESHLINE              = "網格線"
IDC_GURBU_CHECK_PREVIEW_CONTOUR               = "等值線"
IDC_GURBU_CHECK_PREVIEW_VALUE                 = "數值"
IDC_GURBU_CHECK_OPTION_AUTO                   = "自動"
IDC_GURBU_FRAME_OPTION                        = "分析選項"
IDC_GURBU_LABEL_OPTION_MESHSIZE               = "網格尺寸"

// IDD_RCS_BUTTRESS_SMODE_INPUT_SECT_DLG
IDC_GURBU_CHECK_MATERIAL_LCON                 = "輕質混凝土"
IDC_GURBU_FRAME_MATERIAL                      = "材料"
IDC_GURBU_LABEL_MATERIAL_FCK                  = "混凝土"
IDC_GURBU_LABEL_MATERIAL_FY                   = "主筋"
IDC_GURBU_LABEL_MATERIAL_FYS                  = "肋筋"
IDC_GURBU_FRAME_SECTION                       = "斷面"
IDC_GURBU_BTN_SECTION_ADD                     = "新增"
IDC_GURBU_BTN_SECTION_DEL                     = "刪除"
IDC_GURBU_BTN_SECTION_INS                     = "插入"
IDC_GURBU_BTN_SUPPORT_WALL                    = "Support Condition of Basement Wall ..."
IDC_GURBU_LABEL_SECTION_COVER                 = "保護層厚度"
IDC_GURBU_LABEL_SECTION_LENGTH_L              = "長度 (左側)"
IDC_GURBU_LABEL_SECTION_LENGTH_M              = "長度 (中央)"
IDC_GURBU_LABEL_SECTION_LENGTH_R              = "長度 (右側)"
IDC_GURBU_FRAME_LOAD                          = "Static Load"
IDC_GURBU_FRAME_SEIS                          = "Seismic Load"
IDC_GURBU_CHECK_LOAD                          = "Apply Static Pressure Load"
IDC_GURBU_CHECK_SEIS                          = "Apply Seismic Pressure Load"
IDC_GURBU_RADIO_CRACK_DRY                     = "Dry"
IDC_GURBU_RADIO_CRACK_ETC                     = "Etc"
IDC_GURBU_FRAME_SPLICE                        = "主筋間距規則"
IDC_GURBU_RADIO_SPLICE000                     = "不考慮搭接"
IDC_GURBU_RADIO_SPLICE050                     = "50% 搭接"
IDC_GURBU_RADIO_SPLICE100                     = "100% 搭接"
IDC_GURBU_FRAME_BOUNDARY                      = "邊界條件 of Buttress"
IDC_GURBU_LABEL_BOUNDARY_TOP                  = "上方"
IDC_GURBU_LABEL_BOUNDARY_BOT                  = "下方"
IDC_GURBU_LABEL_MATERIAL_FACT                 = "因數"
IDC_GURBU_FRAME_CRACK                         = "裂縫控制"
IDC_GURBU_LABEL_PREVIEW_ITEM                  = "選擇顯示內容 :"
IDC_GURBU_FRAME_PREVIEW                       = "預覽 (鋼筋 && 示意圖)"

// IDD_RCS_URSL_SPACE_DLG
IDD_RCS_URSL_SPACE_DLG                        = "間距資料"
IDC_GURSL_SELECT_MEMBER_FRM                   = "選擇構件"
IDC_GURSL_LIST_BUTTON_SELECT_ALL              = "全選"
IDC_GURSL_LIST_BUTTON_SELECT_NONE             = "全不選"
IDC_GURSL_SPACE_FRM                           = "間距"
IDC_GURSL_LIST_BUTTON_ADD                     = "新增"
IDC_GURSL_LIST_BUTTON_DEL                     = "刪除"
IDC_GURSL_LIST_BUTTON_INS                     = "插入"
IDC_GURSL_LIST_BUTTON_APPLY                   = "套用"
IDC_GURSL_LIST_BUTTON_CANCEL                  = "取消"

// IDD_RCS_URSL_THICK_DLG
IDD_RCS_URSL_THICK_DLG                        = "厚度資料"
IDC_GURSL_MEMBER_FRM                          = "選擇構件"
IDC_GURSL_THICK_FRM                           = "厚度"
IDC_GURSL_LIST_CHECK_SAME_COVER               = "使用相同保護層厚度"

// IDD_RCS_SOIL_PAGE_STAT_DLG
IDC_RCS_SOIL_RADIO_SOIL                       = "依土層性質"
IDC_RCS_SOIL_RADIO_USER                       = "依自定義參數"

// IDD_RCS_SOIL_PAGE_SOIL_DLG
IDC_SOIL_LOAD_LABEL_WL_GL                     = "GL"
IDC_SOIL_LOAD_LABEL_SURCHARGE                 = "外加荷載"
IDC_SOIL_LOAD_LABEL_WATER_LEVEL               = "地下水位高"
IDC_SOIL_LOAD_LABEL_WATER_F                   = "水壓載重係數"
IDC_SOIL_LOAD_LABEL_1ST_GL                    = "GL"
IDC_SOIL_LOAD_LABEL_PROPERTY                  = "土層性質"
IDC_SOIL_LOAD_LABEL_LIVE_F                    = "Live Factor"
IDC_SOIL_LOAD_LABEL_SOIL_F                    = "土壓載重係數"
IDC_SOIL_LOAD_LABEL_1ST_LEVEL                 = "第一層高程"

// IDD_RCS_SOIL_PAGE_USER_DLG
IDC_SOIL_LOAD_BTN_ADD                         = "新增"
IDC_SOIL_LOAD_BTN_DEL                         = "刪除"
IDC_SOIL_LOAD_BTN_INS                         = "插入"

// IDD_RCS_SOIL_USER_DLG
IDD_RCS_SOIL_USER_DLG                         = "土壤載重"
IDC_SOIL_LOAD_USER_FRM                        = "自定義載重"
IDC_SOIL_LOAD_BTN_OK                          = "確認"
IDC_SOIL_LOAD_BTN_CANCEL                      = "取消"

/////// IDD_RCS_COLUMN_PMODE_DLG
IDC_GURCO_FRAME_MATERIAL                      = "材料"
IDC_GURCO_LABEL_MATERIAL_FCK                  = "混凝土"
IDC_GURCO_LABEL_MATERIAL_MB                   = "主筋"
IDC_GURCO_LABEL_MATERIAL_HB                   = "箍筋"
IDC_GURCO_CHECK_MATERIAL_LCON                 = "輕質混凝土"
IDC_GURCO_LABEL_MATERIAL_FACT                 = "因數"
IDC_GURCO_FRAME_SHAPE                         = "形狀"
IDC_GURCO_RADIO_SHAPE_RECT                    = "矩形"
IDC_GURCO_RADIO_SHAPE_CIRCLE                  = "圓形"
IDC_GURCO_FRAME_SECTION                       = "斷面"
IDC_GURCO_LABEL_SECTION_WIDTH                 = "寬度 (B)"
IDC_GURCO_LABEL_SECTION_HEIGHT                = "深度 (H)"
IDC_GURCO_LABEL_SECTION_CORNER                = "Corner"
IDC_GURCO_LABEL_SECTION_LENGTH_X              = "無支撐長度 (x)"
IDC_GURCO_LABEL_SECTION_LENGTH_Y              = "無支撐長度 (y)"
IDC_GURCO_LABEL_SECTION_KFACTOR_X             = "Kx"
IDC_GURCO_LABEL_SECTION_KFACTOR_Y             = "Ky"
IDC_GURCO_FRAME_FORCE                         = "軸力&&彎矩"
IDC_GURCO_LABEL_FORCE_AXF                     = "軸力"
IDC_GURCO_CHECK_APPLY2SHEAR                   = "考慮軸力對剪力強度影響"
IDC_GURCO_LABEL_FORCE_MEMX                    = "彎矩 (x)"
IDC_GURCO_LABEL_FORCE_MEMY                    = "彎矩 (y)"
IDC_GURCO_FRAME_SHEAR                         = "剪力"
IDC_GURCO_LABEL_FORCE_AXIAL_X                 = "軸力 (x)"
IDC_GURCO_LABEL_FORCE_SHX                     = "剪力 (x)"
IDC_GURCO_LABEL_FORCE_AXIAL_Y                 = "軸力 (y)"
IDC_GURCO_LABEL_FORCE_SHY                     = "剪力 (y)"
IDC_GURCO_FRAME_COE                           = "係數"
IDC_GURCO_LABEL_COE_CMX                       = "Cmx"
IDC_GURCO_LABEL_COE_CMY                       = "Cmy"
IDC_GURCO_LABEL_COE_BETAD                     = "βd"
IDC_GURCO_BTN_LCOMB                           = "載重組合 ..."
IDC_FRM_2ND_ORDER 						      = "2nd Order Effect"
IDC_CHK_2ND_ORDER 						      = "Consider 2nd Order Effect"
IDC_GURCO_FRAME_ARRANGE                       = "鋼筋配置"
IDC_GURCO_FRAME_REBAR                         = "鋼筋"
IDC_GURCO_FRAME_TIEBAR                        = "箍筋"
IDC_GURCO_CHECK_TIEBAR                        = "併入剪力強度計算"
IDC_GURCO_LABEL_TIEBAR_MATL                   = "材料"
IDC_GURCO_LABEL_TIEBAR_RBAR                   = "鋼筋"
IDC_GURCO_FRAME_SPLICE                        = "主筋間距規則"
IDC_GURCO_RADIO_SPLICE000                     = "不考慮搭接"
IDC_GURCO_RADIO_SPLICE050                     = "50% 搭接"
IDC_GURCO_RADIO_SPLICE100                     = "100% 搭接"
IDC_GURCO_FRAME_SEISMIC_DESIGN                = "耐震設計"
IDC_GURCO_CHECK_SEISMIC_PROVISIONS            = "套用耐震設計特別規定"
IDC_GURCO_RADIO_SPECIAL_MOMENT                = "SMF"
IDC_GURCO_RADIO_INTERMEDIATE_MOMENT           = "IMF"
IDC_GURCO_RADIO_ORDINARY_MOMENT               = "OMF"
IDC_GURCO_FRAME_DESIGN_OPTION                 = "設計選項"
IDC_GURCO_CHECK_USER_RHO                      = "自定義鋼筋參數"
IDC_GURCO_LABEL_MIN_RHO                       = "最小鋼筋比"
IDC_GURCO_LABEL_MAX_RHO                       = "最大鋼筋比"
IDC_GURCO_FRAME_PM_CURVE                      = "PM 曲線"
IDC_GURCO_FRAME_RESULT                        = "檢核計算結果"
IDC_GURCO_CHECK_SEISMIC_PILOTI_KDS            = "Apply Pilotis Provisions, KDS 41 17 00"

/////// IDD_RCS_COLUMN_RBAR_DLG
IDC_GURCO_LABEL_UNIT2                         = "單位 : "
IDC_GURCO_LABEL_UNIT                          = "單位"
IDC_GURCO_CHECK_USEUSERINPUT                  = "自定義箍筋參數 (端部)"

///////IDD_RCS_COLM_INPUT_SECT3_DLG_EC
IDC_GURCO_CHK_SERVICEABILITY                  = "使用性檢核"
IDC_GURCO_FRAME_FACTORS                       = "係數"
IDC_GURCO_SERVICE_FACTOR_K1                   = "k1"
IDC_GURCO_SERVICE_FACTOR_K2                   = "k2"
IDC_GURCO_SERVICE_FACTOR_K3                   = "k3"

/////// IDD_URDW_PMODE_DLG
IDC_GURDW_FRAME_SECTION                       = "斷面"
IDC_GURDW_CHK_DRAW_INDX                       = "編號"
IDC_GURDW_CHK_DRAW_AXIS                       = "局部座標"
IDC_GURDW_CHK_DRAW_DIMS                       = "尺寸"
IDC_GURDW_CHK_DRAW_VBAR                       = "垂直筋"
IDC_GURDW_CHK_DRAW_HBAR                       = "水平筋"
IDC_GURDW_CHK_DRAW_NAME                       = "牆名稱"
IDC_GURDW_CHK_DRAW_INFO                       = "鋼筋資料"
IDC_GURDW_FRAME_RESULT                        = "檢核計算結果"
IDC_GURDW_LABEL_EFFSECT                       = "有效斷面 : "
IDC_GURDW_LABEL_TXTSIZE                       = "文字尺寸 : "
IDC_GURDW_FRAME_PMCURVE                       = "PM 曲線"

/////// IDD_RCS_COMBINED_WALL_INPUT_DLG_EC
IDC_GURDW_FRAME_MNCURVE                       = "MN 曲線"

/////// IDD_URDW_SECT_DLG
IDC_GURDW_FRAME_MATERIAL                      = "材料"
IDC_GURDW_LABEL_MATERIAL_FCK                  = "混凝土"
IDC_GURDW_LABEL_MATERIAL_MB                   = "垂直筋"
IDC_GURDW_LABEL_MATERIAL_HB                   = "水平筋"
IDC_GURDW_CHECK_MATERIAL_LCON                 = "輕質混凝土"
IDC_GURDW_LABEL_MATERIAL_FACT                 = "因數"
IDC_GURDW_FRAME_LENGTH                        = "設計參數"
IDC_GURDW_LABEL_LENGTH_X                      = "無支撐長度 (x)"
IDC_GURDW_LABEL_LENGTH_Y                      = "無支撐長度 (y)"
IDC_GURDW_LABEL_KFACTOR_X                     = "Kx"
IDC_GURDW_LABEL_KFACTOR_Y                     = "Ky"
IDC_GURDW_FRAME_EFF_AREA                      = "等值尺寸"
IDC_GURDW_LABEL_EFF_AREA_B                    = "寬度 (B)"
IDC_GURDW_LABEL_EFF_AREA_H                    = "高度 (D)"
IDC_GURDW_BTN_EFF_AREA_CALC                   = "依總斷面積計算"
IDC_GURDW_FRAME_TRANSFER                      = "旋轉"
IDC_GURDW_LBL_TRANSFER_WALL                   = "基準單元"
IDC_GURDW_LBL_TRANSFER_DIR                    = "平行於"
IDC_GURDW_LBL_TRANSFER_ANGLE                  = "旋轉角度"
IDC_GURDW_TRANS_BTN                           = "旋轉"
IDC_GURDW_FRAME_SPLICE                        = "主筋間距規則"
IDC_GURDW_RADIO_SPLICE000                     = "不考慮搭接"
IDC_GURDW_RADIO_SPLICE050                     = "50% 搭接"
IDC_GURDW_RADIO_SPLICE100                     = "100% 搭接"

/////// IDD_RCS_COMBINED_WALL_INPUT_SECT1_DLG_EC
IDC_GURDW_FRAME_FLANGE_WIDTH                  = "翼板寬度"
IDC_GURDW_RADIO_ACTU_WIDT                     = "實際寬度"
IDC_GURDW_RADIO_EFFE_WIDT                     = "有效寬度"
IDC_GURDW_FRAME_COE_EC                        = "有效潛變比"
IDC_GURDW_CREEP_COEFFICIENT_STC               = "比值"
IDC_GURDW_FRAME_DGN_MOMENT                    = "設計彎矩"
IDC_GURDW_SLEN_IMPER_CHK                      = "考慮缺陷效應"
IDC_GURDW_SLEN_2ND_CHK                        = "考慮二階效應"
IDC_GURDW_LBL_DGN_MOMENT_LAMLIM               = "λlim = 20*A*B*C/sqrt(n)"
IDC_GURDW_SLEN_CHK_A                          = "由程式計算"
IDC_GURDW_SLEN_CHK_B                          = "由程式計算"
IDC_GURDW_SLEN_CHK_C                          = "由程式計算"

/////// IDD_URDW_WALL_DLG
/////// IDD_RCS_COMBINED_WALL_INPUT_SECT2_DLG_EC
IDC_GURDW_FRAME_UNITWALL                      = "選擇牆單元"
IDC_GURDW_BTN_ADD                             = "新增"
IDC_GURDW_BTN_MOD                             = "修改"
IDC_GURDW_BTN_DEL                             = "刪除"
IDC_GURDW_BTN_WALL_DATA                       = "牆資料..."
IDC_GURDW_FRAME_REBAR                         = "鋼筋"
IDC_GURDW_LABEL_UNIT2                         = "單位 : "
IDC_GURDW_LABEL_UNIT                          = "單位"
IDC_GURDW_LABEL_REBAR_VER                     = "垂直筋"
IDC_GURDW_REBAR_HOR                           = "水平筋"
IDC_GURDW_REBAR_END                           = "端部筋"
IDC_GURDW_FRAME_REBAR_ARR                     = "鋼筋配置方式"
IDC_GURDW_RDO_EQUAL_SPACE                     = "於範圍內平均配置"
IDC_GURDW_RDO_EXACT_SPACE                     = "依指定間距配置"
IDC_GURDW_RDO_FROM_END                        = "從端部"
IDC_GURDW_RDO_FROM_MIDDLE                     = "從中央"
IDC_GURDW_CHK_ADD_REBAR                       = "新增額外鋼筋"
IDC_GURDW_LABEL_THICK                         = "厚度"
IDC_GURDW_LABEL_COVER                         = "保護層厚度"
IDC_GURDW_FRAME_SECT_INFOR                    = "斷面資料"
IDC_GURDW_RADIO_SECT_INFOR_SHAPE              = "位置"
IDC_GURDW_RADIO_SECT_INFOR_MAINBAR            = "垂直"
IDC_GURDW_SECTION_INFO                        = "鍵盤""Insert""鍵 : 於選取的儲存格位置插入新列"

/////// IDD_URDW_FORC_DLG
IDC_GURDW_FRAME_FORCE_FACTOR                  = "外力&&係數"
IDC_GURDW_BTN_LCOMB                           = "載重組合 ..."
IDC_GURDW_FRAME_FORCE                         = "軸力&&彎矩"
IDC_GURDW_LABEL_FORCE_AXF                     = "軸力"
IDC_GURDW_CHECK_APPLY2SHEAR                   = "考慮軸力對剪力強度影響"
IDC_GURDW_LABEL_FORCE_MX                      = "彎矩 (x)"
IDC_GURDW_LABEL_FORCE_MY                      = "彎矩 (y)"
IDC_GURDW_FRAME_SHEAR                         = "剪力"
IDC_GURDW_LABEL_FORCE_VY                      = "剪力 (y)"
IDC_GURDW_LABEL_FORCE_PY                      = "軸力 (y)"
IDC_GURDW_LABEL_FORCE_MX4V                    = "彎矩 (x)"
IDC_GURDW_FRAME_COE                           = "係數"
IDC_GURDW_LABEL_COE_CMX                       = "Cmx"
IDC_GURDW_LABEL_COE_CMY                       = "Cmy"
IDC_GURDW_LABEL_COE_BETAD                     = "βd"

/////// IDD_RCS_COMBINED_WALL_INPUT_SECT3_DLG_EC
IDC_GURDW_LABEL_FORCE_MEMXI                   = "彎矩 (xi)"
IDC_GURDW_LABEL_FORCE_MEMXJ                   = "彎矩 (xj)"
IDC_GURDW_LABEL_FORCE_MEMYI                   = "彎矩 (yi)"
IDC_GURDW_LABEL_FORCE_MEMYJ                   = "彎矩 (yj)"
IDC_GURDW_LABEL_FORCE_AXIAL_X                 = "軸力 (x)"
IDC_GURDW_LABEL_FORCE_SHX                     = "剪力 (x)"
IDC_GURDW_LABEL_FORCE_AXIAL_Y                 = "軸力 (y)"
IDC_GURDW_LABEL_FORCE_SHY                     = "剪力 (y)"

/////// IDD_URDW_WALL_DATA_DLG
/////// IDD_RCS_COMBINED_WALL_INPUT_WALL_DLG_EC
IDD_URDW_WALL_DATA_DLG                        = "牆資料"
IDC_GURDW_FRM_SECTION                         = "斷面"
IDC_GURDW_CHK_DRAW_INDX                       = "鋼筋編號"
IDC_RCS_GURDW_WALL_BTN_ADD                    = "&新增"
IDC_RCS_GURDW_WALL_BTN_INS                    = "&插入"
IDC_RCS_GURDW_WALL_BTN_DEL                    = "&刪除"
IDC_RCS_GURDW_WALL_BTN_OK                     = "&確認"
IDC_RCS_GURDW_WALL_BTN_CANCEL                 = "&取消"

/////// IDD_URDW_MLIST_INFO_DLG
/////// IDD_RCS_COMBINED_WALL_LIST_INFO_DLG_EC
IDD_URDW_MLIST_INFO_DLG                       = "斷面資料"
IDC_GURDW_FRM_MEMB_CUR                        = "當前構件"
IDC_GURDW_FRM_MEMB_SEL                        = "選擇構件"
IDC_GURDW_SEL_COLM_BTN_ALL                    = "全選"
IDC_GURDW_SEL_COLM_BTN_NON                    = "全不選"
IDC_GURDW_SEL_COLM_BTN_INV                    = "反選"

/////// IDD_RCS_DESIGN_LOAD
IDC_RCS_DESIGN_LOAD_DEL_CANCEL                = "請點選欲刪除資料"
IDC_RCS_DESIGN_LOAD_INS_CANCEL                = "請指定插入位置"
IDC_RCS_DESIGN_LOAD_ENTER_NAME                = "請輸入名稱"
IDC_RCS_DESIGN_LOAD_SAME_NAME_EXIST           = "已有相同名稱"
IDC_RCS_DESIGN_LOAD_DEAD_NAME_I               = "載重名稱%i"

/////// IDD_RCS_DEVELOP_SPLICING_DLG
IDD_RCS_DEVELOP_SPLICING_DLG                  = "伸展&搭接"
IDC_RCS_DEVELOP_SPLICING_CALCTYPE             = "計算類別"
IDC_RCS_DEVELOP_SPLICING_CALC                 = "執行計算"
IDC_RCS_DEVELOP_SPLICING_RESULT               = "結果"
IDC_RCS_DEVELOP_SPLICING_TRANS                = "視窗透明度"

/////// IDD_RCS_DEVELOP_SIMPLE_DLG
IDC_RCS_DEVELOP_SIMPLE_FORMULA                = "公式"
IDC_RCS_DEVELOP_SIMPLE_MATERIAL               = "材料"
IDC_RCS_DEVELOP_SIMPLE_REBAR                  = "鋼筋"
IDC_RCS_DEVELOP_SIMPLE_FACTOR                 = "因數"
IDC_RCS_DEVELOP_SIMPLE_BAR                    = "主筋"
IDC_RCS_DEVELOP_SIMPLE_COVER                  = "保護層厚度"
IDC_RCS_DEVELOP_SIMPLE_FSP                    = "使用Fsp"

/////// IDD_RCS_DEVELOP_DETAIL_DLG
IDC_RCS_DEVELOP_DETAIL_FORMULA                = "公式"
IDC_RCS_DEVELOP_DETAIL_MATERIAL               = "材料"
IDC_RCS_DEVELOP_DETAIL_REBAR                  = "鋼筋"
IDC_RCS_DEVELOP_DETAIL_FACTOR                 = "因數"
IDC_RCS_DEVELOP_DETAIL_BAR                    = "主筋"
IDC_RCS_DEVELOP_DETAIL_MAINSPACE              = "間距"
IDC_RCS_DEVELOP_DETAIL_COVER                  = "保護層厚度"
IDC_RCS_DEVELOP_DETAIL_FSP                    = "使用Fsp"
IDC_RCS_DEVELOP_DETAIL_KTR                    = "計算Ktr"
IDC_RCS_DEVELOP_DETAIL_STIRRUP                = "肋筋"
IDC_RCS_DEVELOP_DETAIL_SPACE                  = "間距"
IDC_RCS_DEVELOP_DETAIL_AS                     = "超量鋼筋折減係數"
IDC_RCS_DEVELOP_DETAIL_AS_REQ                 = "需要之As"
IDC_RCS_DEVELOP_DETAIL_AS_USE                 = "使用之As"

/////// IDD_RCS_DEVELOP_COMP_DLG
IDC_RCS_DEVELOP_COMP_FORMULA                  = "公式"
IDC_RCS_DEVELOP_COMP_MATERIAL                 = "材料"
IDC_RCS_DEVELOP_COMP_REBAR                    = "鋼筋"
IDC_RCS_DEVELOP_COMP_FACTOR                   = "因數"
IDC_RCS_DEVELOP_COMP_BAR                      = "主筋"
IDC_RCS_DEVELOP_COMP_AS                       = "超量鋼筋折減係數"
IDC_RCS_DEVELOP_COMP_AS_REQ                   = "需要之As"
IDC_RCS_DEVELOP_COMP_AS_USE                   = "使用之As"

/////// IDD_RCS_DEVELOP_HOOK_DLG
IDC_RCS_DEVELOP_HOOK_FORMULA                  = "公式"
IDC_RCS_DEVELOP_HOOK_MATERIAL                 = "材料"
IDC_RCS_DEVELOP_HOOK_REBAR                    = "鋼筋"
IDC_RCS_DEVELOP_HOOK_FACTOR                   = "因數"
IDC_RCS_DEVELOP_HOOK_BAR                      = "主筋"
IDC_RCS_DEVELOP_HOOK_AS                       = "超量鋼筋折減係數"
IDC_RCS_DEVELOP_HOOK_AS_REQ                   = "需要之As"
IDC_RCS_DEVELOP_HOOK_AS_USE                   = "使用之As"

/////// IDD_RCS_SPLICING_TENS_DLG
IDC_RCS_SPLICING_TENS_FORMULA                 = "公式"
IDC_RCS_SPLICING_TENS_GRADE                   = "等級"
IDC_RCS_SPLICING_TENS_LDFRM                   = "伸展長度"
IDC_RCS_SPLICING_TENS_LDTEXT                  = "ld, 拉力"

/////// IDD_RCS_SPLICING_COMP_DLG
IDC_RCS_SPLICING_COMP_FORMULA                 = "公式"
IDC_RCS_SPLICING_COMP_MATERIAL                = "材料"
IDC_RCS_SPLICING_COMP_REBAR                   = "鋼筋"
IDC_RCS_SPLICING_COMP_BAR                     = "主筋"

////// IDD_ERBE_PMODE_SECT2_DLG
IDC_GERBE_FRAME_CRACK                         = "開裂"
IDC_GURBE_LABEL_EXPOSURE_CLASS                = "暴露等級"
IDC_GURBE_FRAME_CRACK_LIMIT                   = "極限值"
IDC_GURBE_FRAME_DEFLECTION                    = "撓度"
IDC_GURBE_LABEL_DEFL_AMPLIFICATION            = "放大係數"

///RcsDevSplDevCompACIDlg
IDC_RCS_DEVELOP_ACI_COMP_FORMULA              = "公式"
IDC_RCS_DEVELOP_ACI_COMP_MATERIAL             = "材料強度"
IDC_RCS_DEVELOP_ACI_COMP_REBAR                = "鋼筋"
IDC_RCS_DEVELOP_ACI_COMP_FACTOR               = "修正因數"
IDC_RCS_DEVELOP_ACI_COMP_AS                   = "超量鋼筋折減係數"

///RcsDevSplDevDetlACIDlg
IDC_RCS_DEVELOP_ACI_DETAIL_FORMULA            = "公式"
IDC_RCS_DEVELOP_ACI_DETAIL_MATERIAL           = "材料強度"
IDC_RCS_DEVELOP_ACI_DETAIL_REBAR              = "鋼筋"
IDC_RCS_DEVELOP_ACI_DETAIL_FACTOR             = "修正因數"
IDC_RCS_DEVELOP_ACI_DETAIL_AS                 = "超量鋼筋折減係數"

///RcsDevSplDevHookACIDlg
IDC_RCS_DEVELOP_ACI_HOOK_FORMULA              = "公式"
IDC_RCS_DEVELOP_ACI_HOOK_MATERIAL             = "材料強度"
IDC_RCS_DEVELOP_ACI_HOOK_REBAR                = "鋼筋"
IDC_RCS_DEVELOP_ACI_HOOK_FACTOR               = "修正因數"
IDC_RCS_DEVELOP_ACI_HOOK_AS                   = "超量鋼筋折減係數"
									          		  	
///RcsDevSplDevSimpACIDlg			          
IDC_RCS_DEVELOP_ACI_SIMPLE_FORMULA            = "公式"
IDC_RCS_DEVELOP_ACI_SIMPLE_MATERIAL           = "材料強度"
IDC_RCS_DEVELOP_ACI_SIMPLE_REBAR              = "鋼筋"
IDC_RCS_DEVELOP_ACI_SIMPLE_FACTOR             = "修正因數"
IDC_RCS_DEVELOP_ACI_SIMPLE_AS                 = "超量鋼筋折減係數"
									          		  	
///RcsDevSplSplCompACIDlg			          
IDC_RCS_SPLICING_ACI_COMP_FORMULA             = "公式"
IDC_RCS_SPLICING_ACI_COMP_MATERIAL            = "材料強度"
IDC_RCS_SPLICING_ACI_COMP_REBAR               = "鋼筋"
											  	
///RcsDevSplSplTensACIDlg
IDC_RCS_SPLICING_ACI_TENS_FORMULA             = "公式"
IDC_RCS_SPLICING_ACI_TENS_MATERIAL            = "材料強度"
IDC_RCS_SPLICING_ACI_TENS_REBAR               = "鋼筋"
IDC_RCS_SPLICING_ACI_TENS_SPLICEGRADE         = "搭接等級"
IDC_RCS_SPLICING_ACI_TENS_FACTOR              = "修正因數"

///RcsAnchorBoltTabSectionDlg
IDC_GURAB_FRM_MATL       					  = "材料"
IDC_GURAB_LBL_CONC_MATL  					  = "混凝土"
IDC_GURAB_LBL_BOLT_MATL  					  = "錨定螺栓"
IDC_GURAB_FRM_RC_SECTION 					  = "RC斷面"
IDC_GURAB_RDO_RC_CRACK   					  = "開裂"
IDC_GURAB_RDO_RC_UNCRACK 					  = "未開裂"
IDC_GURAB_CHK_RC_LEFT    					  = "左側"
IDC_GURAB_CHK_RC_RIGHT   					  = "右側"
IDC_GURAB_CHK_RC_TOP     					  = "上方"
IDC_GURAB_CHK_RC_BOT     					  = "下方"
IDC_GURAB_CHK_RC_THK     					  = "厚度"
IDC_GURAB_CHK_RC_GROUT   					  = "無收縮水泥砂漿"

///RcsAnchorBoltTabAnchorDlg
IDC_GURAB_FRM_ANCHOR            			  = "錨栓"
IDC_GURAB_LBL_ANCHOR_INST_TYPE  			  = "安裝類型"
IDC_GURAB_LBL_ANCHOR_BOLT_TYPE  			  = "錨栓類型"
IDC_GURAB_LBL_ANCHOR_DIAMETER   			  = "尺寸"
IDC_GURAB_LBL_ANCHOR_LENGTH     			  = "埋置長度 ( hef )"
IDC_GURAB_LBL_DIA_FOR_BEARING                 = "Diameter\nFor Bearing"
IDC_GURAB_LBL_ANCHOR_PULLOUT_NP 			  = "拉拔強度 ( Np )"
IDC_GURAB_LBL_ANCHOR_SPACE_EH   			  = "螺栓J/L段長度 ( eh )"
IDC_GURAB_FRM_STRENGTH_R_F      			  = "強度折減因數"
IDC_GURAB_LBL_STRENGTH_CONC_TENS			  = "混凝土, 拉力"
IDC_GURAB_LBL_STRENGTH_CONC_SHEA			  = "混凝土, 剪力"
IDC_GURAB_LBL_STRENGTH_ANCH_TENS			  = "錨栓, 拉力"
IDC_GURAB_LBL_STRENGTH_ANCH_SHEA			  = "錨栓, 剪力"
IDC_GURAB_FRM_DGN_FACT          			  = "設計"
IDC_GURAB_LBL_DGN_FACT_KC       			  = ""
IDC_GURAB_TABLE_LBL_DGN_FACT_KC       	      = "拉破強度\n係數\n( kc )"
IDC_GURAB_LBL_DGN_FACT_KC       			  = "拉破強度係數 ( kc )"
IDC_GURAB_FRM_BOND_STRESS					  = "黏結式錨栓的握裹應力"

///RcsAnchorBoltTabForceDlg
IDC_GURAB_FRM_FORCE         				  = "力量"
IDC_GURAB_LBL_FORCE_AXIAL   				  = "軸力"
IDC_GURAB_LBL_FORCE_MOMENT_X				  = "彎矩 (x)"
IDC_GURAB_LBL_FORCE_MOMENT_Y				  = "彎矩 (y)"
IDC_GURAB_LBL_FORCE_SHEAR_X 				  = "剪力 (x)"
IDC_GURAB_LBL_FORCE_SHEAR_Y 				  = "剪力 (y)"
IDC_GURAB_LBL_FORCE_TORSION 				  = "扭力"

///RcsAnchorBoltTabLayoutDlg
IDC_GURAB_LBL_LAYOUT_GRID_S_INT_X		      = "間距 (內側 x)"
IDC_GURAB_LBL_LAYOUT_GRID_S_INT_Y		      = "間距 (內側 y)"
IDC_GURAB_LBL_LAYOUT_GRID_S_EXT_X		      = "間距 (外側 x)"
IDC_GURAB_LBL_LAYOUT_GRID_S_EXT_Y		      = "間距 (外側 y)"
IDC_GURAB_LBL_LAYOUT_GRID_NUM_ROW		      = "列數"
IDC_GURAB_LBL_LAYOUT_GRID_NUM_COL		      = "行數"

IDC_GURAB_LBL_LAYOUT_COLM_WIDTH 			  = "寬度"
IDC_GURAB_LBL_LAYOUT_COLM_HEIGHT			  = "高度"

///RcsAnchorBoltLayoutDlg
IDC_GURAB_FRM_LAYOUT_ANCHOR		     	      = "Layout of Anchor Bolt"

///RcsSoilLoadSeisDlg
IDC_LBL_SEIS_FACT                             = "Load Comb. Factor"
IDC_LBL_PARAM_IEE                             = "Importance Factor"
IDC_LBL_PARAM_RMF                             = "Response Mod. Factor"
IDC_LBL_PARAM_EGA                             = "Eff. Ground Acc."
IDC_LBL_GRND_CLAS                             = "Ground Class."
IDC_LBL_LEVL_BEDD                             = "Level of Bed Rock"
IDC_LBL_LEVL_1FLO                             = "1st FL Level"
IDC_LBL_LEVL_2LAY                             = "Level of 2nd Layer"
IDC_LBL_MAT_DEPTH                             = "Depth of Footing"
IDC_LBL_SOIL_PROP                             = "Soil Properties"
IDC_FIND_2ND_LAYER_LEVEL                      = "Find Level of 2nd Layer"

//IDD_ERCF_TAB1_DLG
IDC_GURCF_LIST_SHR_OFFSET_GRP				  = "Shear Offset Information"

//IDD_ERCF_TAB2_DLG
IDC_GURCF_LCOMB_GRP							  = "Load Combinations"
IDC_GURCF_SLS_LCOMB_CHK						  = "Apply SLS Load Combination"
IDC_GURCF_ULS_LCOMB_CHK						  = "Apply ULS Load Combination"
IDC_GURCF_FRAME_COLM						  = "Select Column"
IDC_GURCF_BTN_ADD							  = "Add"
IDC_GURCF_BTN_MOD							  = "Modify"
IDC_GURCF_BTN_DEL							  = "Delete"
IDC_GURCF_BTN_COLM_DATA						  = "Column Data..."
IDC_GURCF_COLM_SECT_SPAN_TEXT				  = "Span"
IDC_GURCF_LABEL_COLMPOS_TYPE				  = "Position"

/////// IDD_ERCF_COLM_DLG
IDD_ERCF_COLM_DLG							  = "Column Data"
IDC_GURCF_FRAME_COLMID                        = "Column ID"
IDC_GURCF_COLM_BTN_ADD						  = "Add"
IDC_GURCF_COLM_BTN_INS						  = "Insert"
IDC_GURCF_COLM_BTN_DEL						  = "Delete"
IDC_GURCF_COLM_BTN_OK						  = "OK"
IDC_GURCF_COLM_BTN_CANCEL					  = "Cancel"

/////// IDD_ERCF_MLIST_COLM_SUB_DLG
IDD_ERCF_MLIST_COLM_SUB_DLG					  = "Column Info."
IDC_GURCF_SEL_COLM_BTN_ALL                    = "All"
IDC_GURCF_SEL_COLM_BTN_NON                    = "None"
IDC_GURCF_SEL_COLM_BTN_INV                    = "Invert"

/////// IDD_ERCF_MLIST_REBAR_DLG
IDD_ERCF_MLIST_REBAR_DLG					  = "Rebar Info."

/////// IDD_ERCF_MLIST_SHEAR_OFFSET_DLG
IDD_ERCF_MLIST_SHEAR_OFFSET_DLG				  = "Shear Offset Info."

/////// IDD_RCS_URBB_PMODE_DLG
IDC_LBL_STRY_SLCT                             = "Select Story"
IDC_CHK_SHOW_FORC                             = "Show Design Force"
IDC_CHK_SHOW_RSLT                             = "Show Design Result"

/////// IDD_RCS_URBB_MEMB_DLG
IDC_CHK_MEMB_ONLY                             = "Member Only"
IDC_LBL_SORT_TYPE                             = "Sort by "
IDS_URBB_MEMB_NOT_SELECTED                    = "Member is not selected."

/////// IDD_RCS_URBC_PMODE_DLG
IDC_FRM_EDIT_MODE                             = "Edit Mode"
IDC_RCS_RADIO_EDIT_MEMB                       = "Member Data"
IDC_RCS_RADIO_EDIT_GRUP                       = "Section Group"
IDS_URBC_MEMB_NOT_SELECTED                    = "Member is not selected."

/////// IDD_RCS_GROUP_CTRL_DLG
IDC_LBL_SECT_GRUP                             = "Section Group"
IDC_BTN_GRUP_ASGN                             = "Assign"
IDC_BTN_GRUP_ADD                              = "Add" 
IDC_BTN_GRUP_DEL                              = "Delete" 
IDC_BTN_GRUP_CLEAR                            = "Clear Unused"
IDC_BTN_GRUP_AUTO                             = "Auto Grouping"
IDC_BTN_GRUP_SMT_DGN                          = "Smart Design" 
IDC_LBL_BLUE_TEXT                             = "※ Blue Text : Section group contains different input data in Section, Rebar and etc."

/////// IDD_URBB_SMART_DGN_DATA_DLG
IDC_CHK_MBAR_SAME                             = "Apply same rebar for each section"

/////// IDD_RCS_URGW_IMPORT_DLG
IDS_GET_DATA_FROM_RC_SHEAR_WALL               = "Get Data from RC Shear Wall"
IDS_SELECT_RC_SHEAR_WALL                      = "Select RC Shear Wall"
